{
    "BABA": {
        "2021-01-14": {
            "Articles": {
                "https://www.investopedia.com/10-biggest-chinese-companies-5077387?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral": {
                    "Article Title": "10 Biggest Chinese Companies",
                    "Relevant Text": [
                        "Revenue (TTM): $83.4 billionNet Income (TTM): $18.7 billionMarket Cap: $641.1 billion1-Year Trailing Total Return: 0.8%Exchange: New York Stock ExchangeAlibaba Group Holding is a holding company which, through subsidiaries, offers e-commerce, online financial, and other internet content services.",
                        "Alibaba also provides internet infrastructure services.",
                        "Alibaba is based in China and provides products and services around the world."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://www.investors.com/market-trend/stock-market-today/dow-jones-today-futures-up-small-caps-chip-stocks-rally-biden-stimulus-gamestop-intel/?src=A00220": {
                    "Article Title": "Dow Jones Today, Stocks Open Higher On Stimulus Hopes; Small Caps, Chip Stocks Rally\t",
                    "Relevant Text": [
                        "And China-based stocks surged as the U.S. Treasury gave up an effort to ban U.S. investment in Alibaba and Tencent Holdings.",
                        "Alibaba, Tencent, BaiduAlibaba Group Holdings (BABA) and Baidu (BIDU) both jumped Thursday, after the Wall Street Journal reported Washington's Metropolitan Police Department officials ended the effort to prevent U.S. investment in the companies.",
                        "The Pentagon reportedly led a move to block Alibaba and Tencent Holdings from receiving U.S. investor dollars, due to suspected links with China's military.",
                        "In Hong Kong, Alibaba shares rose 3.9%, while Tencent gained nearly 5%, according to Bloomberg.",
                        "In U.S. trade, Alibaba climbed 3.6%, topping IBD's Long-Term Leaders list."
                    ],
                    "Sentiment Score": -0.6
                },
                "https://www.investors.com/news/technology/alibaba-stock-tencent-baidu-rise-off-blacklist-baba-bidu-tcehy/?src=A00220": {
                    "Article Title": "Alibaba, Other China Stocks Jump After Avoiding U.S. Blacklist\t",
                    "Relevant Text": [
                        "Alibaba stock jumped Thursday on news the Trump administration decided against barring Americans from investing in a number of key China internet companies.",
                        "In addition to Alibaba (BABA), other China stocks kept off a U.S. blacklist include Tencent Holdings (TCEHY) and Baidu (BIDU).Alibaba stock jumped 3.3%, closing at 242.98, on the stock market today.",
                        "But State and Defense Department blocked a Pentagon effort to add Alibaba, Tencent and Baidu on grounds",
                        "Along With Alibaba Stock, Others Get A LiftOther China stocks getting a lift include Bilibili (BILI), Pinduoduo (PDD) and JD.com (JD).",
                        "Mnuchin reportedly believed including Alibaba stock and other major companies would destabilize markets and create economic fallout.",
                        "Alibaba and Tencent count as China's two most valuable publicly traded companies, with a combined market valuation of $1.3 trillion.",
                        "Alibaba stock, however is below Alibaba record high and trades below Alibaba stock 50-day moving average.",
                        "YOU MAY ALSO LIKE:Is Alibaba Stock A Buy?Alibaba Stock Drops",
                        "As China Regulators Tighten Internet ScrutinyAlibaba Stock Drops On Suspension Of IPOMake"
                    ],
                    "Sentiment Score": 0.329
                },
                "https://www.thestreet.com/markets/5-things-you-must-know-before-the-market-opens-thursday-011421?puc=yahoo&cm_ven=YAHOO": {
                    "Article Title": "Trump Impeachment, Biden's $2 Trillion Plan, Alibaba, Delta - 5 Things You Must Know Thursday",
                    "Relevant Text": [
                        "President-elect Joe Biden reportedly could unveil a Covid-19 relief package of about $2 trillion; President Trump is impeached a second time; U.S. investors can still buy shares of Alibaba and Baidu.",
                        "U.S. Investors Still Allowed to Buy Alibaba, Tencent and Baidu SharesThe U.S. government is expected to let American investors continue to buy shares of Chinese technology giants Alibaba Group (BABA) - Get Report, Tencent Holdings (TCEHY) and Baidu (BIDU)",
                        "The decision to not add Alibaba, Tencent and Baidu - which have about $1.4 trillion in combined market capitalization - to a list of about a dozen companies being examined by the Defense Department as supporting China’s military, intelligence and security services pitted Treasury officials, who feared widespread selloffs and economic fallout, against the Defense Department and Pentagon officials seeking a tougher line against Beijing, The Wall Street Journal Journal noted.",
                        "American depositary receipts of Alibaba rose 2.8% in premarket trading to $241.90, and Baidu gained 2.25% to $242.27.5."
                    ],
                    "Sentiment Score": -0.25
                }
            },
            "Weighted Score": 0.054
        },
        "2021-01-20": {
            "Articles": {
                "https://finance.yahoo.com/news/tencent-super-app-wechat-celebrates-093000894.html": {
                    "Article Title": "Tencent super app WeChat celebrates a decade of influence in China's online world, but are its best years behind?",
                    "Relevant Text": [
                        "WeChat - along with Baidu's search engine and iQiyi and Alibaba Group Holding's Taobao, Tmall and Alipay - saw flat or even negative growth in share of screen time.",
                        "(Alibaba owns the Post).In an effort to fend off the short video challengers, WeChat has been pushing WeChat own version, Channels, launched a year ago.",
                        "Alibaba owns the Post."
                    ],
                    "Sentiment Score": 0.333
                },
                "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-netflix-buy-signal-alibaba-jack-ma-nasdaq-hits-high-in-stock-market-rally/?src=A00220": {
                    "Article Title": "Dow Jones Futures: Netflix Flashes Buy Signal, Alibaba Jumps On Jack Ma; Nasdaq Set To Hit High In Stock Market Rally\t",
                    "Relevant Text": [
                        "The Netflix earnings report was in focus, along with Alibaba (BABA) as founder Jack Ma made founder Jack Ma first public appearance in months.",
                        "Alibaba (BABA) Soars As Jack Ma AppearsAlibaba stock soared as Jack Ma resurfaced in a video aired by state media, speaking to rural school teachers.",
                        "Jack Ma had not been seen since October after making critical comments vs. Chinese regulators that spurred a crackdown on Alibaba (BABA) and other internet platforms.",
                        "BABA stock jumped 7%, set to regain BABA stock 50-day moving average and rallying above BABA stock 200-day line on Tuesday."
                    ],
                    "Sentiment Score": -0.25
                },
                "https://www.investors.com/market-trend/stock-market-today/dow-jones-today-futures-up-biden-inauguration-netflix-disney-jack-ma-returns/?src=A00220": {
                    "Article Title": "Dow Jones Today, Stocks Rally Toward Biden Inauguration; Netflix Boosts Disney; China Stocks Rally As Jack Ma Returns\t",
                    "Relevant Text": [
                        "China stocks continued China stocks recent rally, led by Alibaba Group, which surged as founder Jack Ma resurfaced.",
                        "And How To Invest In The Current UptrendIn U.S. trade, Alibaba Group Holdings (BABA) rallied more than 6%, after company founder Jack Ma made company founder Jack Ma first appearance since disappearing from public view in October.",
                        "Alibaba Group owns the South China Morning Post.",
                        "Alibaba shares are rising for a fourth week from a late December low."
                    ],
                    "Sentiment Score": -0.5
                },
                "https://www.investors.com/news/technology/alibaba-stock-jack-ma-resurfaces-china-stocks-baba-jd-bidu-pdd/?src=A00220": {
                    "Article Title": "Alibaba Stock Jumps As Jack Ma Resurfaces, Prompting Sigh Of Relief\t",
                    "Relevant Text": [
                        "Alibaba stock jumped Wednesday as billionaire Jack Ma was seen in public for the first time in three months and coming at a time when Hong-Kong listed stocks overall have been setting new highs.",
                        "XMa, the co-founder of Alibaba (BABA), resurfaced in a video aired by state media, speaking to rural schoolteachers.",
                        "The comments by billionaire Jack Ma sparked a crackdown on Alibaba and other China internet companies.",
                        "billionaire Jack Ma is the largest shareholder of Ant, which was spun out of Alibaba.",
                        "Chinese authorities subsequently launched a probe into Alibaba for alleged anticompetitive behaviors on Alibaba e-commerce platform, which hit China stocks.",
                        "Action In Alibaba StockAfter Ma resurfaced, the Hong Kong-listed shares of Alibaba surged 8.5% Wednesday.",
                        "That lifted Alibaba's market cap by $58 billion.",
                        "On the New York Stock Exchange, Alibaba stock jumped 5.5%, closing at 265.49 on the stock market today.",
                        "Plans for the Ant Group IPO gave a big boost to Alibaba stock.",
                        "Alibaba was to have a roughly 33% stake in the IPO.If you want to invest in a large-cap stock, a comprehensive selection of articles is here.",
                        "YOU MAY ALSO LIKE:Is Alibaba Stock A Buy"
                    ],
                    "Sentiment Score": -0.091
                },
                "https://www.marketwatch.com/story/alibabas-stock-jumps-after-jack-ma-makes-first-public-appearance-since-october-2021-01-20?siteid=yhoof2": {
                    "Article Title": "   MarketWatch Site Logo  A link that brings you back to the homepage.                   ",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd. BABA, +1.12% shot up 7.3% toward a more than 6-week high in premarket trading Wednesday, putting 7.3% on track for a fifth-straight gain, after co-founder Jack Ma made co-founder Jack Ma first public appearance in nearly three months.",
                        "Since co-founder Jack Ma's last public appearance through Tuesday, Alibaba's stock had dropped 18.8%, while the iShares MSCI China ETF MCHI, +1.85% rose 13.0% and the S&P 500 SPX, +0.68% advanced 9.6%."
                    ],
                    "Sentiment Score": -0.5
                },
                "https://www.thestreet.com/investing/alibaba-baba-jack-ma-resurfaces?puc=yahoo&cm_ven=YAHOO": {
                    "Article Title": "Alibaba Jumps as Jack Ma Resurfaces After Three Months",
                    "Relevant Text": [
                        "Alibaba rises after Jack Ma, the Chinese e-commerce giant's billionaire co-founder, makes his first public appearance in nearly three months.",
                        "Alibaba (BABA)",
                        "Jack Ma had kept out of public view since regulators scuttled the $35 billion IPO, tightened fintech regulations and launched a separate probe into Alibaba - all in a span of weeks.",
                        "Speculation about Jack Ma whereabouts and Jack Ma standing with China President Xi Jinping’s government has escalated more recently after regulators ordered Ant to overhaul Ant business and began the antitrust investigation of Alibaba.",
                        "Shares of Alibaba, the e-commerce giant co-founded by Jack Ma that owns about a third of Ant, jumped 8.5% in Hong Kong.",
                        "American depositary receipts of Alibaba were up 5.28% at $264.97 in trading Wednesday."
                    ],
                    "Sentiment Score": 0.333
                },
                "https://www.thestreet.com/investing/alibaba-baba-stock-trading-jack-ma-resurfaces?puc=yahoo&cm_ven=YAHOO": {
                    "Article Title": "Jack Ma Is Back but Is Alibaba? Let's Look at the Chart",
                    "Relevant Text": [
                        "Alibaba shares are hitting one-month highs as founder Jack Ma finally resurfaces.",
                        "Alibaba (BABA)",
                        "Trading AlibabaDaily chart of Alibaba stock.",
                        "Chart courtesy of TrendSpider.comLook at that painful decline in Alibaba stock as shares tumbled from a high near $320 to a low near $211 in a little under two months.",
                        "In this respect, I want to see how Alibaba handles whichever area comes first.",
                        "If Alibaba loses the $250 mark and Alibaba key moving averages, look for a potential gap-fill down toward $240.Above the 61.8% retracement puts $290.50 on the table, which was the start of a nasty decline amid a gap down in early November."
                    ],
                    "Sentiment Score": 0.334
                },
                "https://www.thestreet.com/markets/5-things-you-must-know-before-the-market-opens-wednesday-012021?puc=yahoo&cm_ven=YAHOO": {
                    "Article Title": "Joe Biden, Alibaba's Jack Ma, Netflix, Procter & Gamble - 5 Things You Must Know Wednesday",
                    "Relevant Text": [
                        "Stock Futures rise ahead of the presidential inauguration of Joe Biden; Netflix surpasses 200 million streaming subscribers; Alibaba co-founder Jack Ma makes Alibaba co-founder Jack Ma first public appearance in nearly three months.",
                        "Alibaba Jumps as Founder Jack Ma ResurfacesAlibaba (BABA",
                        "Since then, government officials have launched an antitrust investigation in Alibaba and squashed the public listing plans of Alibaba online banking subsidiary, Ant Group.",
                        "American depositary receipts of Alibaba jumped 6.86% to $268.91 in premarket trading Wednesday.5."
                    ],
                    "Sentiment Score": -0.25
                }
            },
            "Weighted Score": -0.011
        },
        "2021-01-21": {
            "Articles": {
                "https://www.investopedia.com/insights/jack-mas-worth-influence/?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral": {
                    "Article Title": "Jack Ma's Worth and Influence",
                    "Relevant Text": [
                        "What is Jack Ma, founder and executive chairman of Alibaba Group Holding Ltd.(BABA), worth?",
                        "Back then, Jack Ma's net worth was just $34 billion—a jump from the $20.5 billion Jack Ma's had following the initial public offering (IPO) of Alibaba on the New York Stock Exchange in September 2014.",
                        "Much of Jack Ma's wealth is linked to Alibaba.",
                        "Jack Ma's used to own an 11.7% stake with the largest controlling interest in the company and Alibaba subsidiaries, though Jack Ma's has been divesting Jack Ma's shares over time.",
                        "Less than five years later, Jack Ma's co-founded Alibaba with 17 friends in Hangzhou.4.8% Jack Ma's stake in Alibaba.",
                        "Alibaba holdings now include outright ownership and or important ownership stakes in a movie studio, venture capital funds, Yahoo!",
                        "Jack Ma's stepped down as Chairman of Alibaba on September 10, 2019, on Jack Ma's 55th birthday, as part of a long-standing succession plan.",
                        "A major part of Alibaba’s financial services businesses, including Alipay, is overseen by another holding company that is controlled by Jack Ma's and other investors.",
                        "The $1 billion loan was made to Simon Xie from Alibaba, and then invested into the Yunxi partnership for the purchase of the Wasu shares.",
                        "Yunfeng, Chinese Internet giant Tencent Holdings Limited (OTC: TCTZF), and Huayi purchased controlling interests in Yunfeng, Chinese Internet giant Tencent Holdings Limited (OTC: TCTZF), and Huayi through an empty shell corporation called China Jiuhao Health Industry Corporation Limited (HKSE: 0419.HK).In January 2019, Alibaba's Pictures Group (a subsidiary of Alibaba) extended a $1 million loan to EntertainmentThe Huayi Brothers.",
                        "In return, Huayi pledged to produce 10 theatrical films over the next five years, giving Alibaba Pictures priority as a potential investor, distributor, and merchandiser.",
                        "Ma's CausesMa has taken on the shark fishing industry, pledging to end the consumption of shark fin dishes, and working to bring about the end of trading fins and other shark-based products on Alibaba.",
                        "A small (but meaningful in absolute value) percentage of Alibaba profits are allocated to fund environmental causes.",
                        "Within Alibaba, approximately 47% of the employees are women, and 33% of senior management are women, Ma's CausesMa has asserted, adding proudly, \"We have many women CEOs, CFOs, directors and so on.",
                        "Access to Capital Through AlibabaMa also suggests that various Alibaba ventures have a philanthropic bent.",
                        "\"He wants Alibaba, already the world's largest e-commerce platform, to also be the go-to financier for emerging markets.",
                        "”The Post, a publication owned by Alibaba, quoted Ma's CausesMa as saying, \"Everyone should have a bank account.",
                        "To that end, Alibaba financial services affiliate Ant Financial Services Group (which manages Alipay) has begun to focus on emerging markets such as India, the Philippines, and Malaysia—areas that are considered underserved, compared to established markets like Europe .Alibaba’s financial services affiliate Ant Financial Services Group (which manages Alipay) also runs Yu’E Bao, a money market fund launched in 2013 that offers higher interest on savings and greater liquidity than many of China's traditional banks."
                    ],
                    "Sentiment Score": 0.672
                }
            },
            "Weighted Score": 0.672
        },
        "2021-01-22": {
            "Articles": {
                "https://finance.yahoo.com/news/15-largest-global-ipos-time-103339547.html": {
                    "Article Title": "15 Largest Global IPOs of All Time",
                    "Relevant Text": [
                        "Even very recently, the biggest IPO in history was supposed to take place in China, with Ant Group, an affiliate of Alibaba (NYSE:BABA) (which also had a record IPO in 2014), having been expected to go public.",
                        "Alibaba (Hong Kong)Total value of the IPO (in billions of dollars):",
                        ": 11.3Alibaba has two entries in this list, and the second will be much closer to the top, with 11.3Alibaba listing in Hong Kong not attracting as much publicity as the one in the US.Alibaba Group Holding Ltd",
                        "(NYSE:BABA), Alypay logo, sign, payment gateway, bankingPieter Beens / Shutterstock.com11."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://www.fool.com/investing/2021/01/22/where-will-alibaba-be-in-1-year/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Where Will Alibaba Be in 1 Year?",
                    "Relevant Text": [
                        "The past year has been a volatile one for Alibaba (NYSE:BABA), China's largest e-commerce and cloud platform company.",
                        "However, a series of regulatory challenges abruptly ended Alibaba's rally at the end of the year.",
                        "Chinese regulators suspended the long-awaited IPO of Alibaba's fintech affiliate Ant Group, fined Alibaba for Alibaba unapproved takeover of InTime Retail, then launched an antitrust probe into Alibaba e-commerce business.",
                        "Meanwhile, the \"disappearance\" of Alibaba co-founder Jack Ma, rumors of China's plans to nationalize Alibaba and Ant, delisting threats in the U.S., and the Pentagon's desire to add Alibaba and Tencent (OTC:TCEHY) to an investment blacklist over Alibaba and Tencent (OTC:TCEHY) alleged ties to the Chinese military all cast a dark cloud over the stock.",
                        "However, Alibaba co-founder Jack Ma recently reappeared in public, and the Treasury Department blocked the Pentagon's push against Tencent and Alibaba shortly before President Joe Biden was inaugurated.",
                        "Alibaba's stock rebounded after those developments, but Alibaba's still underperformed many of Alibaba peers.",
                        "Alibaba's stock has risen about 17% over the past 12 months, while Baidu (NASDAQ:BIDU) and Tencent have rallied 87% and 71%, respectively.",
                        "Will Alibaba catch up to Alibaba \"BAT\" peers this year?",
                        "Or will Alibaba continue to struggle as regulators kneecap Alibaba core businesses and allow rivals like JD.com",
                        "to gain ground?Is Alibaba's business still fundamentally strong?Alibaba controlled 56% of China's e-commerce market last year, according to eMarketer.",
                        "Alibaba's main marketplaces, Taobao and Tmall, are primarily paid listing platforms.",
                        "Alibaba doesn't take on any inventories, but Alibaba fulfills orders through Alibaba logistics subsidiary Cainiao.",
                        "JD.com takes on inventories and fulfills Alibaba orders with Alibaba first-party logistics network.",
                        "Pinduoduo offers paid listings like Alibaba, but Pinduoduo encourages shoppers to team up on bulk purchases.",
                        "Alibaba generates most of Alibaba revenue and all of Alibaba profits from Alibaba core commerce business, which includes all Alibaba online marketplaces, brick-and-mortar stores, and logistics services.",
                        "Alibaba subsidizes the growth of Alibaba three other unprofitable businesses -- Alibaba Cloud, Alibaba digital media and entertainment unit, and Alibaba innovation initiatives -- with the profits from Alibaba core commerce business.",
                        "This cycle enables Alibaba to expand Alibaba ecosystem with other services, including streaming media, cloud services, video games, and even a search engine, to widen Alibaba moat against Tencent, Baidu, and other tech giants.",
                        "Baidu's also enabled Alibaba to generate robust revenue and net income growth over the past five years:Growth (YOY) 2017 2018 2019 2020 6M 2021",
                        "33%Analysts expect Alibaba's growth to accelerate in the second half of the year, and for Alibaba revenue and earnings to rise 48% and 35%, respectively, for the full year.",
                        "However, investors shouldn't place too much faith in those forecasts, which might not fully reflect the impact of China's recent antitrust moves against Alibaba's e-commerce business.",
                        "aheadThe growth of Alibaba's online marketplaces was already decelerating prior to the antitrust probe, and Alibaba had grown increasingly dependent on lower-margin businesses -- including brick-and-mortar stores, wholesale channels, cross-border marketplaces, and Cainiao -- to boost Alibaba core commerce revenue.",
                        "That's why the adjusted EBITA margin of Alibaba's core commerce business dropped to 35% in the second quarter, down from 38% in both the first quarter and the prior-year quarter.",
                        "That decline might seem minor, but that downward trend could continue and impair Alibaba's ability to support Alibaba other unprofitable businesses.",
                        "To make matters worse, China's antitrust regulators reportedly plan to prevent Alibaba from locking merchants into exclusive deals.",
                        "JD, Pinduoduo, and several merchants have called these deals -- which bar Alibaba's sellers from cross-listing their products on other platforms -- anticompetitive.",
                        "If those new rules are passed, Alibaba's merchants could list Alibaba's merchants products on other platforms and cause unprecedented challenges for Taobao and Tmall.",
                        "The road aheadAlibaba currently trades at just 20 times forward earnings, compared to forward P/E ratios of 29 and 21 for Tencent and Baidu, respectively.",
                        "Alibaba's stock certainly looks cheap, but Alibaba arguably faces more regulatory headwinds than Tencent and Baidu.",
                        "I believe Alibaba's valuation will limit Alibaba downside potential this year, but I also believe Baidu will underperform Tencent, Baidu, and other Chinese tech stocks as China's antitrust regulators find new ways to rein in Baidu dominant e-commerce and cloud businesses."
                    ],
                    "Sentiment Score": 0.07
                }
            },
            "Weighted Score": 0.104
        },
        "2021-01-23": {
            "Articles": {
                "https://www.fool.com/investing/2021/01/23/do-you-own-these-3-top-tech-stocks-yet/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Do You Own These 3 Top Tech Stocks Yet?",
                    "Relevant Text": [
                        ": Sure, the large-cap internet FAANG stocks are nice, as are the large-cap internet FAANG stocks the large-cap internet FAANG stocks counterparts, the \"BAT\" in China (Baidu, Alibaba, and Tencent Holdings).",
                        "Sea Limited is kind of like a mixture of Tencent and Alibaba; of note, Tencent has a roughly 25% stake in Sea Limited, and helped Tencent launch Tencent initial Garena video gaming platform back in 2010.",
                        "Compared with the trillion-dollar-plus FAANG stocks, Alibaba at $725 billion, and Tencent at $844 billion, there is still plenty room for Sea Limited to appreciate in the years ahead."
                    ],
                    "Sentiment Score": -0.333
                }
            },
            "Weighted Score": -0.333
        },
        "2021-01-25": {
            "Articles": {
                "https://finance.yahoo.com/news/alibaba-group-holding-limited-moodys-152607993.html": {
                    "Article Title": "Alibaba Group Holding Limited -- Moody's announces completion of a periodic review of ratings of Alibaba Group Holding Limited",
                    "Relevant Text": [
                        "Announcement of Periodic Review: Moody's announces completion of a periodic review of ratings of Alibaba Group Holding LimitedGlobal Credit Research - 25 Jan 2021Hong Kong, January 25, 2021 --",
                        "Moody's's Investors Service (\"Moody's\") has completed a periodic review of the ratings of Alibaba Group Holding Limited and other ratings that are associated with the same analytical unit.",
                        "a periodic review of the ratings of Alibaba Group Holding Limited and other ratings that are associated with the same analytical unit was conducted through a portfolio review discussion held on 19 January 2021 in which Moody's reassessed the appropriateness of the ratings in the context of the relevant principal methodology (ies), recent developments, and a comparison of the financial and operating profile to similarly rated peers.",
                        "a periodic review of the ratings of Alibaba Group Holding Limited and other ratings that are associated with the same analytical unit did not involve a rating committee.",
                        "Alibaba Group Holding Limited's (Alibaba) A1 issuer rating reflects the fact that Alibaba Group Holding Limited's (Alibaba) A1 issuer rating integrated and diversified e-commerce platforms provide sustainable cost advantages, which allow Alibaba Group Holding Limited's (Alibaba) A1 issuer rating to generate high profit margins and maintain strong credit quality.",
                        "Alibaba Group Holding Limited's (Alibaba) A1 issuer rating also takes into account",
                        "Alibaba's 1) well-established brand name and leading market position in China's (A1) fast-growing e-commerce market; 2) Alibaba track record of monetization through fees from online marketing, services and subscriptions; and 3) transaction-based commissions.",
                        ", Alibaba Group Holding Limited's (Alibaba) A1 issuer rating also incorporates risks related to Alibaba's aspiration to continue to expand Alibaba business scope within and outside China.",
                        "Alibaba Group Holding Limited's (Alibaba) A1 issuer rating also takes into account potential contingent liabilities associated with Ant Group Co., Ltd., in which Alibaba owns a 33% stake.",
                        "Alibaba Group Holding Limited's (Alibaba) A1 issuer rating also takes into consideration increased regulatory risk, as illustrated by a recent antitrust investigation by the State Administration for Market Regulation (SAMR).",
                        "a recent antitrust investigation by the State Administration for Market Regulation (SAMR) is credit negative and could limit Alibaba's revenue and earnings growth."
                    ],
                    "Sentiment Score": 0.545
                },
                "https://www.fool.com/investing/2021/01/25/why-jdcom-finished-higher-today/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Why JD.com Finished Higher Today",
                    "Relevant Text": [
                        "whatBernstein analyst Robin Zhu said whatBernstein analyst Robin Zhu expects JD to out-compete offline rivals and to see strong growth in most of its key business segments.whatBernstein analyst Robin Zhu gave a similar endorsement to JD rival Alibaba (NYSE:BABA), but only rated it market perform, showing whatBernstein analyst Robin Zhu sees greater upside to JD.Now whatAfter a blowout performance in 2020 that saw the stock jump 150%, the Chinese e-commerce company has gotten off to a strong start in 2021.",
                        "It seems to have benefited from diminishing fears about a crackdown against Alibaba."
                    ],
                    "Sentiment Score": -0.998
                }
            },
            "Weighted Score": 0.182
        },
        "2021-01-27": {
            "Articles": {
                "https://www.fool.com/investing/2021/01/27/whats-happening-with-netflix/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "What's Happening With Netflix?",
                    "Relevant Text": [
                        "Alibaba (NYSE:BABA) shares pop on a long-awaited sighting of founder Jack Ma.",
                        "Hill: Shares of Alibaba are up more than 5% because company founder Jack Ma has made company founder Jack Ma first public appearance in three months.",
                        "But look, I think if you're an Alibaba shareholder over the last few months, wondering legitimately, \"Where's this guy been?",
                        "Let's be clear, this does not mean that the scrutiny of Alibaba goes away, but company founder Jack Ma's the founder.",
                        "The Chinese government has since said that The Chinese government are going to pursue possibly some more strict regulatory oversight of Alibaba, and that could include breaking up different parts of Alibaba.",
                        "At the very least, they are going to pursue possibly some more strict regulatory oversight of Alibaba, and that could include breaking up different parts of the company are taking some more strident action against Ant Financial, which is the payments part of Alibaba.",
                        "the scrutiny of Alibaba doesn't go away."
                    ],
                    "Sentiment Score": 0.714
                }
            },
            "Weighted Score": 0.714
        },
        "2021-01-28": {
            "Articles": {
                "https://www.fool.com/investing/2021/01/28/3-chinese-tech-stocks-id-buy-right-now/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "3 Chinese Tech Stocks I'd Buy Right Now",
                    "Relevant Text": [
                        "Bilibili isn't profitable yet, but Bilibili's already attracted big investments from Tencent and Alibaba (NYSE:BABA), which both consider Bilibili a valuable buffer against ByteDance's Gen Z-oriented apps.",
                        "That price-to-sales ratio isn't cheap, but That price-to-sales ratio looks surprisingly reasonable in a market filled with stocks trading at over 40 times next year's sales.2. BaiduBaidu, which owns China's largest search engine, has traditionally been the weakest link of the BAT triumvirate, which includes Alibaba and Tencent.",
                        "Alibaba advertising business struggled as China's internet users spent more time on WeChat, ByteDance's Douyin (known as TikTok overseas), and other platforms.",
                        "Baidu also doesn't face any antitrust headwinds even as regulators crack down on Alibaba and Tencent.",
                        "JD.comJD is China's largest direct retailer and second-largest e-commerce company after Alibaba.",
                        "Unlike Alibaba -- which runs paid listing platforms, doesn't take on inventories, and fulfills orders with a logistics subsidiary -- JD takes on inventories and fulfills orders with Baidu first-party logistics network.",
                        "JD's business model is more capital-intensive than Alibaba's, but Alibaba shields shoppers from low-quality and counterfeit products.",
                        "Most of that growth came from China's lower-tier cities, which brought in about 80% of Alibaba new shoppers during the third quarter.",
                        "JD's margins have also been expanding, thanks to economies of scale and Alibaba infrastructure and logistics investments.",
                        "its infrastructure and logistics investments throttled Alibaba earnings in previous years, but its infrastructure and logistics investments're now reducing Alibaba infrastructure costs, lowering the costs of acquiring new shoppers, and helping Alibaba stay profitable.",
                        "JD's decision to offer Alibaba logistics platform as a service to other companies is also raking in higher-margin revenue.",
                        "Those valuations, along with Alibaba's antitrust troubles, indicate JD's stock could still have plenty of room to run after more than doubling in 2020."
                    ],
                    "Sentiment Score": -0.083
                },
                "https://www.fool.com/investing/2021/01/28/these-3-high-growth-stocks-are-still-dirt-cheap/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "3 High-Growth Stocks That Are Still Dirt-Cheap",
                    "Relevant Text": [
                        "AlibabaLike Facebook, Alibaba (NYSE:BABA) has been a magnet for controversy recently.",
                        "First, the Chinese government blocked the IPO of Ant Group, Alibaba's former financial arm, and in December Alibaba opened up an antitrust investigation against Alibaba, sending the stock tumbling.",
                        "When founder Jack Ma resurfaced on a videoconference call, Alibaba shares popped.",
                        "First, founder Jack Ma no longer holds a formal position in Alibaba so founder Jack Ma whereabouts or founder Jack Ma standing with the Chinese government aren't as significant as his whereabouts or his standing with the Chinese government might seem.",
                        "Secondly, Alibaba's own success is key to many of the things the Chinese government wants to accomplish, including being a technology leader, so Alibaba has no interest in severely damaging Alibaba.",
                        "Alibaba's business itself remains as strong as ever.",
                        "Alibaba's business itself operates the biggest e-commerce marketplace in the world with an annual gross merchandise volume of more than $1 trillion and has growth businesses in areas like cloud, logistics, and digital media.",
                        "In the quarter ended last September, revenue rose 30% to $22.8 billion, and adjusted net income jumped 44% year over year to $6.9 billion, giving Alibaba's business itself the same kind of impressive margins as Facebook.",
                        "Despite Alibaba's business itself robust growth and profitability, Alibaba is also cheaper than the average S&P 500 stock, trading at a P/E of just 28.",
                        "While Chinese stocks do tend to trade at a discount because of regulatory concerns, Alibaba seems significantly undervalued even after accounting for that discrepancy.3.",
                        "(NASDAQ:VRM), an online used car dealer, offers one example as Alibaba has missed out on the broader rally in e-commerce stocks during the pandemic.",
                        "Vroom shares popped on Alibaba's IPO in June, but the stock price has actually fallen since then"
                    ],
                    "Sentiment Score": 0.0
                }
            },
            "Weighted Score": -0.042
        },
        "2021-02-01": {
            "Articles": {
                "https://realmoney.thestreet.com/investing/stocks/is-alibaba-a-buy-on-another-pullback--15554052?puc=yahoo&cm_ven=YAHOO": {
                    "Article Title": "Is Alibaba a Buy on Another Pullback?",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd. (BABA) is due to report Alibaba Group Holding Ltd. latest quarterly numbers before the opening of trading Tuesday.",
                        "When we last looked at (BABA) on Nov. 4 we wrote that, \"The charts of (BABA) tell me that the risks of ownership have gone up.",
                        "now we could see another 'shoe drop' on (BABA) at any time -- probably while we markets are closed.",
                        "How do The charts of BABA look now?",
                        "In the daily bar chart of (BABA), below, we can see that the shares plunged to near $210 in late December followed by a rebound in January taking (BABA) back above the 200-day average line and the 50-day moving average line.",
                        "As (BABA) has rebounded in recent weeks the On-Balance-Volume (OBV) has made an uneven recovery.",
                        "In the weekly bar chart of (BABA), below, we see improvement in the picture and the indicators.",
                        "In this daily Point and Figure chart of (BABA), below, we can see a potential downside price target in the $241 area.",
                        ": I have no special knowledge of what (BABA) will report on Tuesday morning"
                    ],
                    "Sentiment Score": 0.226
                },
                "https://www.investopedia.com/alibaba-q3-2021-earnings-5100942?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral": {
                    "Article Title": "Alibaba Earnings: What to Look For",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd. (BABA)",
                        "The Chinese State Administration for Market Regulation has launched an antitrust probe into Alibaba, mirroring the antirust investigations U.S. regulators have launched against big American tech firms Facebook Inc. (FB) and Google parent Alphabet Inc.",
                        "(GOOGL).﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿Investors will be watching to see how Alibaba is dealing with an antitrust probe, and also whether Alibaba can maintain Alibaba robust growth when Alibaba reports earnings on February 2, 2021 for Q3 FY 2021.﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿ Alibaba's fiscal year (FY) ends in March.",
                        "Analysts expect adjusted earnings per American Depositary Share (ADS) and revenue to post healthy gains compared to the year-ago quarter.﻿﻿﻿﻿﻿﻿﻿﻿﻿Investors also will focus on Alibaba's annual active consumers in China, also called \"active buyers.",
                        "Analysts expect annual active consumers in China to grow, but at a slower rate than in recent years.﻿﻿﻿﻿﻿﻿﻿﻿﻿Shares of Alibaba have outperformed the broader market over the past year.",
                        "After reaching a recent peak in late October in anticipation of a public listing of Alibaba's financial-technology affiliate, Ant Group Co. Ltd., the stock tumbled when the IPO was blocked by Chinese regulators.",
                        "Alibaba's stock initially jumped after reporting earnings for Q2 FY 2021.",
                        "Adjusted earnings per ADS climbed 37.2%, Alibaba fastest rise since Q3 FY 2020.",
                        "Alibaba highlighted the strong performance of Alibaba core commerce and cloud computing businesses.﻿﻿﻿﻿﻿",
                        "In Q1 FY 2021, Alibaba posted an 18.1% rise in adjusted earnings per ADS as revenue rose 33.8%.",
                        "While Alibaba's revenue is still growing at a fast pace, the company's revenue has decelerated from growth rates between 56-61% between late FY 2017 and early FY 2019.﻿﻿﻿﻿﻿ the stock continued the stock upward trend over subsequent months until the stock peak at the end of October."
                    ],
                    "Sentiment Score": -0.544
                },
                "https://www.investors.com/research/alibaba-stock-buy-now/?src=A00220": {
                    "Article Title": "Is Alibaba Stock A Buy Right Now? Here's What Earnings, Chart Show\t",
                    "Relevant Text": [
                        "Alibaba stock has rallied off lows and is holding above Alibaba stock 10-week moving average.",
                        "But with earnings due Tuesday before the open, is BABA stock a buy right",
                        "Sellers were in Alibaba stock on Nov. 3 after the $34.5 billion Ant Group IPO was suspended in Shanghai and Hong Kong.",
                        "The decision to suspend the $34.5 billion Ant Group IPO came after Shanghai exchange officials said the $34.5 billion Ant Group IPO would halt the listing due to Alibaba's inability to fulfill conditions amid changes in the regulatory environment.",
                        "Sellers were in Alibaba stock again on Nov. 5 after Alibaba reported earnings and missed on sales.",
                        "BABA stock crashed another 8% on Nov. 10 after Chinese regulators announced new draft antimonopoly rules for China online platforms like Alibaba and JD.com (JD), among others.",
                        "Alibaba stock sold off sharply on Dec. 24 on news the Chinese government launched an anti-monopoly probe into the e-commerce giant.",
                        "Ant Group is the fintech arm of Alibaba (BABA)",
                        "Alibaba Stock Fundamental AnalysisWhen",
                        "it comes to liquid, megacap stocks in China, it's hard to find a more compelling name in terms of fundamentals than Alibaba.",
                        "Alibaba Stock Fundamental AnalysisWhen has been a big winner since Alibaba Stock Fundamental AnalysisWhen IPO in September 2014.Expectations were high for Alibaba's Singles Day annual shopping event in November, and Alibaba didn't disappoint as sales nearly doubled from the year-ago period to $74 billion.",
                        "Alibaba has been able to stay in growth mode despite a slowdown in Alibaba core e-commerce business.",
                        "Alibaba's business in China looks a lot like Amazon's in the U.S.",
                        "Alibaba's cloud-computing business is showing solid growth, just like Amazon's booming web services business.",
                        "Alibaba also sees dollar signs in food delivery.",
                        "In 2018, Alibaba merged Alibaba food delivery service Ele.me with Alibaba lifestyle app Koubei to better compete with Tencent (TCEHY)-owned Meituan.",
                        "Sales at Alibaba's digital media and entertainment unit are also rising.",
                        "entertainment unit includes Alibaba's videostreaming platform Youku, along with entertainment unit music streaming service, Xiami.",
                        "Alibaba also has a licensing agreement with Walt Disney (DIS) unit Buena Vista International, giving Alibaba access to a large amount of Disney content.",
                        "Join IBD experts as IBD experts analyze actionable stocks in the coronavirus stock market rally on IBD LiveAnd just like Amazon, Alibaba sees potential in the sports streaming market.",
                        "In 2018, Alibaba partnered with China Central Television and streamed all matches of the 2018 FIFA World Cup.",
                        "Alibaba said the World Cup, as well as continued investment in original content, fueled daily average subscriber growth of 200% for Alibaba's videostreaming platform Youku.",
                        "Top-Rated StockAlibaba's Composite Rating of 89 (scale of 1-99 with 99 being the best) is helped by strong earnings and sales growth in recent quarters along with excellent 12-month price performance.",
                        "For a megacap stock, Alibaba continues to deliver torrid growth.",
                        "Alibaba breaks down Alibaba revenue into four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment and Innovation Initiatives.",
                        "Alibaba top-notch SMR Rating (sales + margins + return on equity) of A from IBD Stock Checkup.",
                        "Check Out IBD Stock Lists and other IBD content to find dozens more of the best stocks to buy or watchFor its current fiscal year 2021, earnings per share are expected to jump 37%, with 20% growth seen in fiscal 2022.Etsy (ETSY) is a top-rated stock in IBD's internet retail group, according to IBD Stock Checkup, along with China-based JD.com (JD), Vipshop (VIPS) and eBay (EBAY).Alibaba Stock Technical AnalysisAfter a heavy volume breakout for Alibaba stock in late November 2019, the coronavirus stock market crash brought sellers into Alibaba stock.",
                        "Alibaba, a member of IBD's Long-Term Leaders portfolio, soared out of a 24-week consolidation in July.",
                        "A 36% pullback for Alibaba stock in the second half of 2018 shook out a lot of sellers in Alibaba stock and ultimately served to reset the base count.",
                        "Alibaba broke out of a flat base with a 268.10 buy point during the week ended Aug. 28.",
                        "Alibaba rallied for a bit, then started to pull back with the broad market.",
                        "A new flat base formed with a 299.10 buy point, although an early entry was seen when Alibaba stock gapped up on Sept. 30.Improving RS LineAlibaba's relative strength line is starting to point higher after a nice rally off lows.",
                        "A stock's relative strength line, found in daily and weekly charts at investors.com, compares Alibaba stock's daily price performance to the S&P 500.",
                        "An upward-sloping RS line means Alibaba stock is outperforming the S&P 500.",
                        "A downward-sloping line means Alibaba stock is lagging the S&P 500.The bottom line: With Alibaba stock still far off Alibaba high, Alibaba still has overhead supply to work through.",
                        "But aggressive investors might opt to buy if BABA stock gaps up on earnings.",
                        "If Alibaba does, watch for Alibaba to hold gains.",
                        "averse investors will wait and see if Alibaba can fully form the right side of a base.",
                        "If Alibaba does, a breakout to new highs isn't out of the question."
                    ],
                    "Sentiment Score": 0.218
                },
                "https://www.thestreet.com/investing/alibaba-baba-stock-trading-earnings-preview-020121?puc=yahoo&cm_ven=YAHOO": {
                    "Article Title": "Alibaba Earnings Preview: How to Trade It After the Print",
                    "Relevant Text": [
                        "Alibaba has had a bumpy couple of months, with shares bouncing up and down.",
                        "LetAlibaba look at the charts ahead of earnings.",
                        "Alibaba - Get Report shares were rallying on Monday, up about 2.5% with earnings due up on Tuesday before the stock market opens.",
                        "A lot has happened in the last few months, sending shares of Alibaba spiraling lower.",
                        "Then there worries about founder Jack Ma, Alibaba possible monopolistic operations and concerns over being delisted from the New York Stock Exchange.",
                        "Throw it all together and this cocktail of negative news had Alibaba fall 34% from peak to trough in about two months.",
                        "Trading AlibabaDaily chart of Alibaba stock.",
                        ", Alibaba stock dipped to a low of $211.",
                        "There Alibaba found immediate support, as the 100-week moving average and prior high from 2018 stepped in and buoyed the share price.",
                        "Alibaba stock has recovered nicely since then, although there’s been some bumps along the way.",
                        "Alibaba now sits just above the 10-day, 50-day and 200-day moving averages ahead of earnings.",
                        "Bulls are hoping that Alibaba delivers a solid result and management reassures investors on Alibaba current political situation in China.",
                        "Specifically, longs would love to see Alibaba reclaim the 100-day moving average near $271.",
                        "Doing so would also trigger a two-times monthly-up rotation, meaning Alibaba would take out the January and December high, at $269 and $271.30, respectively."
                    ],
                    "Sentiment Score": 0.0
                }
            },
            "Weighted Score": 0.029
        },
        "2021-02-02": {
            "Articles": {
                "https://finance.yahoo.com/news/alibaba-group-announces-december-quarter-120200148.html": {
                    "Article Title": "Alibaba Group Announces December Quarter 2020 Results",
                    "Relevant Text": [
                        "Alibaba Group Holding Limited (NYSE: BABA and HKEX: 9988, \"Alibaba\" or \"Alibaba Group\") today announced Alibaba Group Holding Limited (NYSE: BABA and HKEX: 9988, \"Alibaba\" or \"Alibaba Group\")",
                        "Thanks to the rapid recovery of China’s economy, Alibaba had another very healthy quarter,\" said Daniel Zhang, Chairman and Chief Executive Officer of Alibaba Group.",
                        "Alibaba Group achieved another successful 11.11 Global Shopping Festival by stimulating consumption, satisfying consumer demands and supporting the business recovery of merchants in response to the impact of the pandemic.",
                        "Looking ahead, Alibaba are confident that Alibaba will continue to create value for Alibaba customers, lead with innovation and make Alibaba contributions to society.",
                        "\"\"We delivered another solid quarter, with revenue growth of 37% year-over-year and adjusted EBITDA up 22% year-over-year, while our strong free cash flow enabled us to further invest in strategic areas,\" said Maggie Wu, Chief Financial Officer of Alibaba Group.",
                        "Alibaba Group are pleased that Alibaba Group Alibaba Cloud business achieved positive adjusted EBITA during the quarter and Cainiao Network was operating cash flow positive.",
                        "This service leverages the capabilities and economies of scale of Alibaba’s logistics infrastructure to enable brands to quickly enter the China market while reducing sales uncertainty and controlling costs.",
                        "In the quarter ended December 31, 2020, online purchases, a majority of which was driven by Alibaba’s digital technology, represented 24% of Sun Art’s sales of goods.",
                        "Cainiao Network – improving efficiency across the Alibaba ecosystem and the logistics industry in China and internationallyIn the December quarter, Cainiao Network revenue grew 51% year-over-year to RMB11,360 million (US$1,741 million), primarily due to the increase in volume of orders fulfilled from China fast growing cross-border and international commerce retail businesses.",
                        "Cloud ComputingAlibaba Cloud empowers the digital transformation of enterprises by providing comprehensive technology solutions and services in Cloud ComputingAlibaba Cloud for a wide range of industries.",
                        "For the first time, Cloud ComputingAlibaba Cloud achieved positive adjusted EBITA during the quarter due to the realization of economies of scale.",
                        "During the twelfth annual 11.11 Global Shopping Festival, Cloud ComputingAlibaba Cloud provided a highly scalable, reliable and secure public cloud infrastructure, which at Cloud ComputingAlibaba Cloud peak processed 583,000 orders per second.",
                        "Since we migrated Cloud ComputingAlibaba Cloud e-commerce businesses onto Cloud ComputingAlibaba Cloud a year ago, our e-commerce businesses are now able to seamlessly create, upgrade and deploy on a cloud native approach; and this capability was especially important during the twelfth annual 11.11 Global Shopping Festival, helping us to improve operating efficiency and ensure business continuity.",
                        "Cloud ComputingAlibaba Cloud continues to invest in research and development of leading cloud technologies to help Cloud ComputingAlibaba Cloud customers undertake digital transformation and enable the growth of our customers businesses.",
                        "Cloud ComputingAlibaba Cloud proprietary technologies have consistently won recognition from leading research and advisory organizations such as Gartner and Forrester.",
                        "For example, according to Gartner November 2020 report, among the large-scale global cloud providers, Cloud ComputingAlibaba Cloud is the only Chinese company with the Leader ranking for database management system under Gartner Magic Quadrant measurement.",
                        "Alibaba Pictures continued Alibaba Pictures solid track record in content investment and distribution.",
                        "For example, Alibaba Pictures invested in and distributed the top three grossing films during the three-day New Year holiday in China, which accounted for over 80% of China box office sales during the period according to Beacon Box Office data.",
                        "Alibaba Pictures popular original dramas, such as Professional Single, also contributed to Youku’s strong subscription growth during the December quarter.",
                        "In addition, Alibaba Pictures enhanced the production capabilities of popular original dramas that are exclusively featured on Youku and increased IP commercialization by content owners on our online marketplaces.our continued to improve the operational efficiency of our digital media and entertainment businesses through disciplined investment in content and production capability.",
                        "Anti-monopoly InvestigationOn December 24, 2020, Alibaba Group received a notice of an investigation from the State Administration for Market Regulation (\"SAMR\") that Alibaba Group had commenced an investigation pursuant to the PRC Anti-monopoly Law.",
                        "Update on Ant GroupOn November 3, 2020, Alibaba Group announced the suspension of Alibaba Group proposed dual listings and initial public offering on the Shanghai Stock Exchange STAR board and the Hong Kong Stock Exchange.",
                        "Due to recent significant changes in the Fintech regulatory environment in China, Alibaba Group is in the process of developing Alibaba Group rectification plan, which will need to go through the relevant regulatory procedures.",
                        "Therefore, Alibaba Group business prospects and IPO plans are subject to substantial uncertainties.",
                        "Currently, our are unable to make a complete and fair assessment of the impact that these changes and uncertainties will have on Alibaba Group.",
                        "our will update the market once Alibaba Group has completed the relevant regulatory procedures for the market rectification plan.",
                        "The increase was primarily due to increases in both the number of paying members and average revenue from paying members on Alibaba.com, as well as an increase in revenue generated by cross-border related value-added services.",
                        "By type of awards: Alibaba Group share-based awards(1) 6,587 4% 7,703 5% 7,694 1,179 4% 17 % (0) % Ant Group share-based awards(2) 347 0% 16,056 10% 542 83 0% 56 % (97) % Others(3) 896 0% 935 1% 843 129 0% (6) % (10) % Total share-based compensation expense 7,830 4% 24,694 16% 9,079 1,391 4% 16 % (63) %_____________________ (1)",
                        "This represents Alibaba Group share-based awards granted to Alibaba Group employees.",
                        "Share-based compensation expense related to Alibaba Group share-based awards remained stable in this quarter compared to the previous quarter.",
                        "WEBCAST AND CONFERENCE CALL INFORMATIONAlibaba Group’s management will hold a conference call to discuss the financial results at 7:30 a.m.",
                        "live webcast of the conference call can be accessed at http://www.alibabagroup.com/en/ir/earnings.",
                        "; same conference ID as shown above).Our results announcement and accompanying slides are available at INFORMATIONAlibaba Group’s Investor Relations website at http://www.alibabagroup.com/en/ir/home on February 2, 2021.ABOUT ALIBABA GROUPAlibaba Group’s mission is to make it easy to do business anywhere.",
                        "2021.ABOUT ALIBABA GROUPAlibaba Group’s aims to build the future infrastructure of commerce.",
                        "2021.ABOUT ALIBABA GROUPAlibaba Group’s envisions that 2021.ABOUT ALIBABA GROUPAlibaba Group’s customers will meet, work and live at Alibaba, and that 2021.ABOUT ALIBABA GROUPAlibaba Group’s will be a good company that lasts for 102 years.",
                        "In addition, statements that are not historical facts, including statements about Alibaba’s strategies and business plans, Alibaba beliefs, expectations and guidance regarding the growth of Alibaba business and Alibaba revenue, the business outlook and quotations from management in STATEMENTSThis announcement, as well as Alibaba’s strategic and operational plans, are or contain forward-looking statements.",
                        "Alibaba may also make forward-looking statements in Alibaba periodic reports to the U.S. Securities and Exchange Commission (the \"SEC\"), in announcements made on the website of The Stock Exchange of Hong Kong Limited (the \"Hong Kong Stock Exchange\"), in press releases and other written materials and in oral statements made by Alibaba officers, directors or employees to third parties.",
                        "A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: Alibaba ability to maintain the trusted status of Alibaba ecosystem; risks associated with sustained investments in Alibaba business and strategic acquisitions and investments; Alibaba expected revenue growth and ability to maintain or grow Alibaba revenue or business; Alibaba ability to continue to compete effectively and maintain and improve the network effects of Alibaba ecosystem; company culture; Alibaba ability to continue to innovate; risks and challenges associated with operating a complex and large-scale company; risks associated with expanding Alibaba international and cross-border businesses and operations; fluctuations in general economic and business conditions in China and globally; impacts of The COVID-19 pandemic; uncertainties arising from competition among countries and geopolitical tensions, including protectionist or national security policies; changes in laws, regulations and regulatory environment that affect Alibaba business operations; risks associated with the performance of Alibaba business partners, including but not limited to Ant Group; privacy and data protection regulations and concerns; and security breaches, and assumptions underlying or related to any of the foregoing.",
                        "Further information regarding these and other risks is included in Alibaba filings with the SEC and announcements on the website of the Hong Kong Stock Exchange.",
                        "All information provided in this results announcement is as of the date of this results announcement and are based on assumptions that we believe to be reasonable as of the date of this results announcement, and Alibaba does not undertake any obligation to update any forward-looking statement, except as required under applicable law.",
                        "ALIBABA GROUP HOLDING LIMITEDUNAUDITED CONSOLIDATED INCOME",
                        "(3,407 ) Share of results of equity method investees 2,165 (3,601 ) (552 ) (9,278 ) 992 152 Net income 50,132 77,977 11,950 140,002 150,938 23,132 Net loss attributable to noncontrolling interests 2,042 1,558 239 6,211 5,006 767 Net income attributable to Alibaba Group Holding Limited 52,174",
                        "ALIBABA GROUP HOLDING LIMITEDREVENUEThe",
                        "following table sets forth ALIBABA GROUP HOLDING revenue by segments for the periods indicated:Three months ended December 31, Nine months ended December 31, 2019",
                        "Revenue from core commerce is primarily generated from our China retail marketplaces, Freshippo, Sun Art, 1688.com, Lazada, AliExpress, Alibaba.com, local consumer services and Cainiao logistics services.",
                        "ALIBABA GROUP HOLDING LIMITEDUNAUDITED CONSOLIDATED INCOME following table sets forth our income (loss) from operations by segments for the periods indicated:",
                        "ALIBABA GROUP HOLDING LIMITEDINFORMATION ABOUT SEGMENTSThe table below sets forth selected financial information of ALIBABA GROUP operating segments for the nine months ended December 31, 2020:",
                        "ALIBABA GROUP HOLDING LIMITEDUNAUDITED CONSOLIDATED BALANCE SHEETSAs of March 31,",
                        "358,160 54,890ALIBABA GROUP HOLDING LIMITEDUNAUDITED CONSOLIDATED BALANCE SHEETS",
                        "1,635,266 250,615ALIBABA GROUP HOLDING LIMITEDUNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWSThree months ended December 31, Nine months ended December 31, 2019",
                        "ALIBABA GROUP HOLDING LIMITEDRECONCILIATIONS OF NON-GAAP MEASURES TO THE NEAREST COMPARABLE U.S. GAAP MEASURESThe table below sets forth a reconciliation of ALIBABA net income to adjusted EBITA and adjusted EBITDA for the periods indicated: Three months ended December 31, Nine months ended December 31, 2019",
                        "55,880 68,380 10,480 132,219 166,944 25,585ALIBABA GROUP HOLDING LIMITEDRECONCILIATIONS OF NON-GAAP MEASURES TO THE NEAREST COMPARABLE U.S. GAAP MEASURES",
                        "179,743 27,547ALIBABA GROUP HOLDING LIMITEDRECONCILIATIONS OF NON-GAAP MEASURES TO THE NEAREST COMPARABLE U.S. GAAP MEASURES",
                        "ALIBABA GROUP HOLDING LIMITEDRECONCILIATIONS OF NON-GAAP MEASURES TO THE NEAREST COMPARABLE U.S. GAAP MEASURES",
                        "(CONTINUED)The table below sets forth a reconciliation of ALIBABA GROUP diluted earnings per share/ADS to non-GAAP diluted earnings per share/ADS for the periods indicated: Three months ended December 31, Nine months ended December 31, 2019",
                        "ALIBABA GROUP HOLDING LIMITEDSELECTED OPERATING DATAAnnual active consumersThe table below sets forth the number of active consumers on our China retail marketplaces for the periods indicated:",
                        "Rob Lininvestor@alibabagroup.comMedia Contacts:",
                        "Brion Tinglerbrion.tingler@alibaba-",
                        "inc.comCathy Yancathy.yan@alibaba-inc.com"
                    ],
                    "Sentiment Score": 0.316
                },
                "https://finance.yahoo.com/news/post-earnings-alibaba-opportunity-watch-181006612.html": {
                    "Article Title": "Post -Earnings Alibaba Opportunity & What To Watch In Amazon's Earnings Tonight",
                    "Relevant Text": [
                        "Alibaba BABA is the value needle in a haystack of stretched tech valuations.",
                        "Now Alibaba BABA is headed back up towards $300, with China's economy surging into 2021",
                        "Alibaba BABA shares sold off 3% from these positive earnings, which appears to be a trend for the tech sector's highly anticipated year-end reports.",
                        "The Big BABA Sell-OffIt started with Jack Ma's public criticism of the Chinese government and The Big BABA Sell-OffIt financial system.",
                        "Ant Group is the shining star of China's fintech space, and Alibaba holds a 33% stake in this innovative financial behemoth.",
                        "Then in the domino effect of Jack Ma's regretful critiques, regulators released draft-rules on Wednesday concerning anti-competitive behavior, seemingly targeting Alibaba.",
                        "Xi's administration felt that Jack Ma's economic influence (Alibaba & Ant Group) challenged China's power and control.",
                        "The BABA OpportunityAt the end of the day, China has no intention of destroying China most profitable tech giant.",
                        "BABA shares whiplash sell-off has created a fantastic opportunity to purchase one of Asia's highest potential enterprises at a substantial discount.",
                        "BABA is currently trading in a Fibonacci bound range between $265 and $252 (which you can see circled in red below).",
                        "This is a tremendous opportunity to buy BABA at a discount before a discount breaks out of a discount current range, and after the amazing quarter a discount just released, I'm not sure how long a discount will remain this low.",
                        "Alibaba has a cornucopia of digital products at Alibaba disposal, and Alibaba will use all of them to control and profit off the prolific digitalization occurring in Asia today.",
                        "The fact that the Amazon of the East (aka BABA) has not taken off like the Amazon of the East (aka BABA)",
                        "Alibaba controls the e-commerce space (80% market share), the cloud-computing category (roughly 50% market share), and a 33% stake in the leading FinTech in the most populous and soon-to-be largest economy on Earth.",
                        "Alibaba is valued at less than half of the Amazon of the East (aka BABA) despite producing substantially wider margins, greater profitability, and having a more extensive revenue growth outlook for the next couple of years.",
                        "BABA was undervalued before this end of year sell-off.",
                        "Final ThoughtsBABA still has a massive amount of upside potential waiting to be priced in.",
                        "The Chinese economy is beginning to recover beyond pre-COVID growth rates, with Alibaba's digital technology being the centerpiece of this expansion.",
                        "Ant's IPO delay and the anti-competitive probe are just a small hiccup in Alibaba's tech dominance in the East.",
                        "BABA's post-earnings drip presents us with a very savvy long-term buying opportunity."
                    ],
                    "Sentiment Score": 0.117
                },
                "https://finance.yahoo.com/news/zacks-industry-outlook-highlights-amazon-112511218.html": {
                    "Article Title": "Zacks Industry Outlook Highlights: Amazon, Alibaba, JD.com, ASOS and Jumia Technologies",
                    "Relevant Text": [
                        "Inc. AMZN, Alibaba Group Holding Limited BABA, JD.com,",
                        "Chinese companies Alibaba and JD.com are other significant players.",
                        "JD is the second largest ecommerce company in China after Alibaba."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://finance.yahoo.com/video/earnings-roundup-alibaba-beats-harley-171129422.html": {
                    "Article Title": "Earnings roundup: Alibaba beats, Harley-Davidson posts surprise loss",
                    "Relevant Text": [
                        "Julie Hyman, Myles Udland and Brian Sozzi discuss some of Tuesday morning’s early movers, including Alibaba — which topped estimates — as well as Harley-Davidson — which posted an expected loss as Alibaba unveils a turnaround plan.",
                        "One of some of the earnings that came out this morning and are seeing some notable moves in the market is Alibaba, of course the Chinese giant e-commerce company.",
                        "Alibaba said revenue was up by 37%.And Alibaba's numbers tend to look good on the face of it.",
                        "37%.And Alibaba's numbers had strong results, 37%.And Alibaba's numbers said, from Singles Day.",
                        "37%.And Alibaba's numbers sort of extended the promotions from that.",
                        "Yeah, I mean, I think-- look, Alibaba has a fine business in Alibaba",
                        "that I think people are excited about, but certainly Alibaba, you know, 1/3 stake in Ant was a part of Alibaba's value.",
                        "And Alibaba coming out and saying, you know, on the call that Alibaba don't really know what's going on right now",
                        "or Alibaba're not able to provide an update, rather, to the markets--",
                        "all Alibaba said is the, you know, IPO process for Ant is subject to, quote, \"substantial uncertainties.",
                        "So the relationship between Alibaba, between Jack Ma, between Ant, between China, certainly there was always some level of it being fraught because no one comes before the party, at least not anyone that, you know, Xi hasn't endorsed as being able to come before the party."
                    ],
                    "Sentiment Score": 0.413
                },
                "https://www.fool.com/earnings/call-transcripts/2021/02/02/alibaba-group-holding-ltd-baba-q3-2021-earnings-ca/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Alibaba Group Holding Ltd. (BABA) Q3 2021 Earnings Call Transcript",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd.",
                        "BABA)Q3 2021",
                        "Welcome to Alibaba Group's December quarter 2020 results conference call.",
                        "Alibaba Group's December quarter 2020 results conference call over to Rob Lin, head of investor relations of Alibaba Group.",
                        "Good day, everyone, and welcome to Alibaba Group's December quarter 2020 results conference call.",
                        "A replay of Alibaba Group's December quarter 2020 results conference call will be available on our corporate website later today.",
                        "our celebrated another milestone with Alibaba Cloud, which achieved our first profitable quarter with positive adjusted EBITDA.",
                        "Although the changing regulatory landscape applicable to fintech and Internet platform companies present near-term challenge to Alibaba, we regard this as important opportunities for reassessing and improving we business practices.",
                        "Alibaba Cloud continues to grow at a rapid rate with 50% revenue growth year over year in December quarter, reflecting the massive potential of China's cloud computing market.",
                        "Alibaba Cloud believe China's cloud computing market is still at an early stage as data intelligence applications and the demand for computing power will become universal across all industry sectors.",
                        "Alibaba Cloud will leverage Alibaba's unique advantage in technology and data intelligence applications while continuing to invest for growth.",
                        "Alibaba Cloud have spent several years upgrading Lazada's technology infrastructure, business model and operating efficiency.",
                        "Alibaba Cloud believe Alibaba Cloud are now well positioned to capitalize on the Southeast Asia market, which is experiencing accelerated growth through further investment into long-term opportunity with the goal of increasing Alibaba Cloud market share and users' mind share.",
                        "So for instance, businesses such as Alibaba Cloud has graduated to profitability stage after over 10 years of investment.",
                        "businesses such as Alibaba Cloud address new consumption demand and behaviors and will continue to expand our addressable markets in China.",
                        "Investments in these new seeds business will continue to enhance consumer experience and engagement, as well as helping increasing Alibaba ecosystems penetration into developing areas of China.",
                        "Next, Alibaba Cloud continued to empower the digital transformation of enterprises by providing comprehensive technology solution and services in Alibaba Cloud for wide range of industries.",
                        "After Alibaba Cloud continuous investment for years, AliCloud achieved a positive EBITDA growth, a positive EBITDA during This past quarter.",
                        "So for DME, Alibaba Cloud continue to improve the operating efficiency through disciplined investment in content and production capability.",
                        "Alibaba provides a wide range of services, including sophisticated management tools for merchants to manage merchants online business, as well as merchants online and offline combined businesses that contribute to enhanced overall efficiency for merchant operations.",
                        "We know that there are a number of important new technologies where you're making progress coming out of DAMO Academy with Alibaba Cloud.",
                        "my question has to do with Daniel's opening statement in which Daniel talked about the evolving policy environment and Alibaba's commitment to take on more social responsibility.",
                        "As a platform economy, Alibaba has always taken very seriously Alibaba social responsibility and has made this very much part of the mainstream of Alibaba efforts to develop as a platform.",
                        "And in years past, Alibaba've indeed done a lot of work on this front.",
                        "Going forward, as a platform economy ever more deeper integrated with the overall economic and social development of the country, Alibaba do plan to take on yet more social responsibility.",
                        "Something very important for Alibaba, in particular, is mainstreaming that responsibility and making Alibaba part and parcel of everything we do, be Alibaba helping to create jobs, to stimulate employment, helping SMEs on every front from product distribution all the way through manufacturing.",
                        "There are many things that Alibaba can do.",
                        "And I think the key point here is the social responsibility for Alibaba is not something separate from Alibaba operations, and Alibaba business rather is at the mainstream of everything Alibaba're doing around operations and business as a platform.",
                        "But we strongly believe that the investment in Taobao Deals is very important measures for us to target the customers in low-tier cities even in the rural areas and leverage us supply power from like other business in Alibaba, like 1688, so on",
                        "So we will continue to invest in this Taobao Grocery business, but we will try to leverage all the resources we have in Alibaba and in some new retail business, in we investing companies and in we multiple supply channels.",
                        "But over time, we will roll the service out across the country and the collaboration with multiple suppliers across Alibaba business.",
                        "But obviously, Alibaba has a very big advantage in term -- in many areas.",
                        "First is that by leveraging Alibaba huge scale, e-commerce, financial services and logistics, Alibaba are able to build a very scalable cloud infrastructure, which support Alibaba own business first today, and Alibaba roll out this infra to serve third-party clients.",
                        "So in this case, in terms of internal scalability, Alibaba are in a very superior position.",
                        "And indeed, it's very interesting that whenever we talk about Alibaba's financial performance and future outlook, we always get questions about Alibaba profitability and Alibaba margins and whether Alibaba expect to be able to sustain our profitability and our margins at the same levels that our profitability and our margins have been at.",
                        "And Alibaba're very grateful for that.",
                        "And Alibaba's answer to that is very clear.",
                        "speakerIf you look at where Alibaba is today in terms of profitability, looking at the last 12 months or actually",
                        "I'm wondering if you could tell Our which of those you see as having the largest addressable markets and the greatest amount of synergy because Our know that in new retail and in cloud, Alibaba was the first company to get into those spaces.",
                        "AnalystUnknown speakerGregory Zhao -- Barclays -- AnalystAlex Yao -- J.P. Morgan -- AnalystAlicia Yap -- Citigroup -- AnalystThomas Chong -- Jefferies -- AnalystJerry Liu -- UBS -- AnalystYoussef Squali -- Truist Securities -- AnalystJames Lee -- Mizuho Securities -- AnalystBinnie Wong -- HSBC -- AnalystMore BABA analysisAll earnings call transcripts"
                    ],
                    "Sentiment Score": 0.2
                },
                "https://www.investopedia.com/alibaba-q3-2021-earnings-5100942?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral": {
                    "Article Title": "Alibaba Earnings: What Happened",
                    "Relevant Text": [
                        "Alibaba Cloud achieved positive adjusted EBITA for the first time.",
                        "What HappenedAlibaba reported Q3 FY 2021 earnings per ADS that surpassed analyst expectations.",
                        "Alibaba also noted that Alibaba cloud business achieved positive adjusted earnings before interest, taxes, and amortization (EBITA) for the first time.(Below",
                        "is Investopedia's original earnings preview, published February 1, 2021.)What to Look ForAlibaba Group Holding Ltd. (BABA), the Chinese e-commerce giant that's successfully expanding amid the COVID-19 pandemic, has found Alibaba in the crosshairs of China's market watchdog.",
                        "The Chinese State Administration for Market Regulation has launched an antitrust probe into Alibaba, mirroring the antirust investigations U.S. regulators have launched against big American tech firms Facebook Inc. (FB) and Google parent Alphabet Inc.",
                        "(GOOGL).﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿Investors will be watching to see how Alibaba is dealing with an antitrust probe, and also whether Alibaba can maintain Alibaba robust growth when Alibaba reports earnings on February 2, 2021 for Q3 FY 2021.﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿ Alibaba's fiscal year (FY) ends in March.",
                        "Analysts expect adjusted earnings per American Depositary Share (ADS) and revenue to post healthy gains compared to the year-ago quarter.﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿Investors also will focus on Alibaba's annual active consumers in China, also called \"active buyers.",
                        "Analysts expect annual active consumers in China to grow, but at a slower rate than in recent years.﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿Shares of Alibaba have outperformed the broader market over the past year.",
                        "After reaching a recent peak in late October in anticipation of a public listing of Alibaba's financial-technology affiliate, Ant Group Co. Ltd., the stock tumbled when the IPO was blocked by Chinese regulators.",
                        "Alibaba's stock initially jumped after reporting earnings for Q2 FY 2021.",
                        "Adjusted earnings per ADS climbed 37.2%, Alibaba fastest rise since Q3 FY 2020.",
                        "Alibaba highlighted the strong performance of Alibaba core commerce and cloud computing businesses.﻿﻿﻿﻿﻿",
                        "In Q1 FY 2021, Alibaba posted an 18.1% rise in adjusted earnings per ADS as revenue rose 33.8%.",
                        "While Alibaba's revenue is still growing at a fast pace, the company's revenue has decelerated from growth rates between 56-61% between late FY 2017 and early FY 2019.﻿﻿﻿﻿﻿ the stock continued the stock upward trend over subsequent months until the stock peak at the end of October."
                    ],
                    "Sentiment Score": -0.784
                },
                "https://www.thestreet.com/investing/alibaba-tops-q3-profit-forecast-see-ant-group-uncertainties?puc=yahoo&cm_ven=YAHOO": {
                    "Article Title": "Alibaba Tops Q3 Earnings Forecast, Notes 'Substantial Uncertainties' For Ant Group",
                    "Relevant Text": [
                        "Alibaba said the business prospects and IPO plans for Alibaba Ant Group subsidiary are \"subject to substantial uncertainties\" thanks to \"significant changes in the Fintech regulatory environment in China.",
                        "\"Alibaba",
                        "Group Holding Co. Ltd. (BABA)",
                        "Alibaba said diluted non-GAAP diluted earnings for the three months ending in December, Ant Group's fiscal third quarter, were pegged at $4.42 per share, well ahead of the Refinitiv-collected forecast of $3.23 pre share.",
                        "Group revenues, Alibaba said, rose 37% to 221.08 billion Chinese yuan, or $34.25 billion.",
                        "Thanks to the rapid recovery of China economy, Alibaba had another very healthy quarter,” said CEO Daniel Zhang.",
                        "“Alibaba achieved another successful 11.11 Global Shopping Festival by stimulating consumption, satisfying consumer demands and supporting the business recovery of merchants in response to the impact of the pandemic.",
                        "\"Looking ahead, Alibaba are confident that Alibaba will continue to create value for Alibaba customers, lead with innovation and make Alibaba contributions to society.",
                        "”Alibaba's U.S.-listed shares were marked 1% lower in pre-market trading following the earnings release to change hands at $262.25 each.",
                        "Alibaba's Singles Day shopping event in November topped $75 billion in gross merchandise value, a staggering total that dwarfs the record $10.4 billion spent during Amazon Inc.'s (AMZN)",
                        "China's State Administration for Market Regulation launched China's State Administration for Market Regulation probe into Alibaba, and demanded a meeting with officials from Alibaba affiliate Ant Group Co., amid a broader push to tackle anticompetitive practices in internet commerce, including the alleged pressuring of merchants to list merchants goods on a single online platform."
                    ],
                    "Sentiment Score": -0.182
                }
            },
            "Weighted Score": 0.057
        },
        "2021-02-03": {
            "Articles": {
                "https://finance.yahoo.com/news/alibaba-group-holding-limited-moodys-024807480.html": {
                    "Article Title": "Alibaba Group Holding Limited -- Moody's assigns A1 to Alibaba's proposed senior notes; outlook stable",
                    "Relevant Text": [
                        "Moody's assigns A1 to Alibaba's proposed senior notes; outlook stableGlobal Credit Research - 03",
                        "Feb 2021Hong Kong, February 03, 2021 -- Moody's's Investors Service has assigned an A1 senior unsecured rating to the proposed USD notes to be issued by Alibaba Group Holding Limited.",
                        "Alibaba will use the proceeds for general corporate purposes and for eligible projects in connection with Alibaba sustainability notes.",
                        "RATINGS RATIONALE\"Alibaba's A1 issuer rating reflects RATINGS RATIONALE\"Alibaba integrated and diversified e-commerce platforms, which provide sustainable cost advantages that allow Alibaba to generate solid profit margins and maintain strong credit quality with a solid net cash position,\" says Choi.",
                        "Alibaba's well-established brand name and dominance in China's (A1 stable) fast-growing e-commerce market; Alibaba track record of monetization through fees from online marketing, services and subscriptions; and transaction-based commissions,\" adds Choi.",
                        "The rating incorporates risks related to Alibaba's aspiration to continue expanding Alibaba business scope within and outside China.",
                        "As Alibaba expands Alibaba businesses, Moody expects Moody currently high profit margins to be diluted because of the consolidation of strategic business initiatives such as Ele.me, Lazada and Cainiao Network.",
                        "However, strategic business initiatives such as Ele.me, Lazada and Cainiao Network should also help Alibaba grow Alibaba scale and expand Alibaba service offerings, and in turn strengthen Alibaba cash flow.",
                        "While a recent antitrust investigation by the State Administration for Market Regulation (SAMR) is credit negative and could limit Alibaba's revenue and earnings growth, Alibaba has a track record of working with regulators to make operational changes without materially hurting Alibaba solid business profile.",
                        "In view of Alibaba ongoing investment requirement and heightened regulatory risks, Moody expects Alibaba to maintain a strong balance sheet with net cash position over the next one to two years, along with a prudent approach to investments and acquisitions.",
                        "The rating also takes into account potential contingent liabilities associated with Ant Group Co., Ltd, in which Alibaba holds a 33% stake.",
                        "Alibaba's proposed senior unsecured notes will improve Alibaba debt maturity profile and expand Alibaba capacity to accommodate any funding needs over the next one to two years.",
                        "Alibaba's proposed senior unsecured notes will have limited impact on Alibaba's debt leverage, as earnings growth in the coming one to two years should offset the increase in debt.",
                        "Moody expects Alibaba's revenue to grow around 20% per annum in the next one to two years from the RMB644.2 billion reported for the 12 months ended December 2020.",
                        "Moody also expects Moody to maintain steady EBITDA margins of 20%-25%.As such, Moody expects Alibaba's adjusted debt/EBITDA will stay around 1.0x-1.2x in the next one to two years, which is appropriate for Moody A1 ratings.",
                        "Alibaba's liquidity is excellent.",
                        "As of 31 December 2020, Alibaba held RMB456 billion in cash and cash-like resources.",
                        "Together with estimated annual operating cash flow of RMB180 billion-RMB210 billion, Alibaba's internal cash flow is more than sufficient to cover Alibaba reported short-term debt of RMB15.0 billion, capital spending and investment needs.",
                        "In terms of social factors, Alibaba is exposed to heightened scrutiny by regulators with respect to perceived anticompetitive behavior, in turn raising legal, regulatory and reputational risks.",
                        "legal, regulatory and reputational risks could impede Alibaba's business growth.",
                        "Alibaba also faces moderate data privacy and security risks, as Alibaba generates and processes a large volume of personal, transaction, demographic and behavioral data.",
                        "Alibaba manages such risks, inter alia, by complying with legal and regulatory requirements for the collection, processing, retention and protection of Alibaba data.",
                        "However, Alibaba could face operating and financial damage in the event of a cyber breach.",
                        "Governance considerations include the concentration of director selection voting power in Alibaba Partnership, which is comprised primarily of Alibaba's directors and executive officers.",
                        "In addition, Alibaba operates under a variable interest entities (VIE) structure, and the main VIEs (onshore operating companies) that generate cash flow are controlled by two limited partnerships comprised of members of Alibaba Partnership or senior management.",
                        "In addition, Alibaba's shareholder base is highly diversified and includes more than 200 shareholders across the world.",
                        "FACTORS THAT COULD LEAD TO AN UPGRADE OR DOWNGRADE OF THE RATINGSThe stable outlook on Alibaba's issuer and senior unsecured ratings reflects Moody's expectation that Alibaba will maintain Alibaba dominant position in China's e-commerce market, continue to generate steady cash flow from Alibaba domestic retail and wholesale marketplaces to support Alibaba strong balance sheet with a solid net cash position, and not engage in larger-than-expected debt-funded acquisitions such that Alibaba financial profile will remain appropriate with Alibaba A1 ratings in the next 1 -2 years.",
                        "An upgrade is unlikely, because Alibaba's rating is already at the same level as China's sovereign rating, a country where Alibaba conducts most of Alibaba operations and activities.",
                        "Moody's could downgrade the ratings if Alibaba (1) fails to fend off competition and experiences substantial declines in market shares or substantial disruptions in Alibaba integrated ecosystem that hurt revenue growth and cash flow; (2) deviates from Alibaba stated financial policy and aggressively grows loans at Ant Group beyond Moodycurrent expectations, thereby increasing the risk of additional financial requirements from Alibaba; and (3) engages in aggressive acquisitions that strain Alibaba balance sheet liquidity or increase Alibaba overall risk profile.",
                        "Moody's will also monitor for any sustained deterioration in the company's adjusted retained cash flow/debt, which has been maintained around 70%-85% since 2015.Furthermore, adverse developments in the regulatory framework that adversely affect Alibaba's operations and cash flow generating capabilities, or result in a significant capital call from Ant Group, would strain the rating.",
                        "Founded in 1999 by Jack Ma and a group of partners, Alibaba Group Holding Limited (Alibaba) is a global leader in retail commerce, which enables merchants, brands, retailers and other businesses to engage and transact with brands, retailers and other businesses users and customers.",
                        "Predominantly focused on China, Alibaba operates various retail and wholesale marketplaces within Alibaba core commerce segment.",
                        "Alibaba also engages in cloud computing services, digital media and entertainment and innovation initiatives.",
                        "Alibaba owns a 63% stake in Cainiao Network, an operator of a logistics data platform and a global fulfilment network leveraging on capacities of local partners.",
                        "Alibaba completed Alibaba initial public offering on the New York Stock Exchange on 19 September 2014.",
                        "Alibaba completed Alibaba secondary public offering on the Hong Kong Stock Exchange on 26 November 2019.REGULATORY"
                    ],
                    "Sentiment Score": 0.222
                },
                "https://finance.yahoo.com/news/alibaba-sales-beat-estimates-regulatory-120737684.html": {
                    "Article Title": "Alibaba Offers Few Answers as Crackdown Uncertainty Persists",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd. offered investors few clues into how the regulatory crackdown on Jack Ma’s tech empire will impact Alibaba Group Holding Ltd. future growth after reporting a stronger-than-expected 37% increase in quarterly sales.",
                        "Alibaba Group Holding Ltd. has established a special taskforce to conduct internal reviews and is actively communicating with antitrust regulators on complying with antitrust regulators requirements as investigations continue, Alibaba Group Holding Ltd. said Tuesday.",
                        "Alibaba Group Holding Ltd.’s also unable to make a complete assessment of how the ongoing “rectification” of affiliate Ant Group Co. will affect Alibaba Group Holding Ltd. business, according to the statement.",
                        "Uncertainty began in November when regulators first torpedoed Ant Group’s record initial public offering, then launched regulators investigation into Alibaba Group Holding Ltd..",
                        "Alibaba Group Holding Ltd. stock has dropped 13% since Ant’s aborted debut, the worst performance on Hong Kong’s benchmark Hang Seng Index.",
                        "The shares in New York fell 3.9%.“Ant Group’s business prospects and IPO plans are subject to substantial uncertainties,” Alibaba Chief Executive Officer Daniel Zhang said on a conference call Tuesday.",
                        "”Separately, Alibaba Group Holding Ltd. said Alibaba Group Holding Ltd. will kick off what could be a $5 billion dollar bond sale this week, picking up a plan that went quiet when Alibaba Group Holding Ltd. founder had been out of sight.",
                        "Alibaba Group Holding Ltd. CrackdownAlibaba’s shares recouped some of Alibaba CrackdownAlibaba’s shares losses after Jack Ma resurfaced in public during a live-streamed video conference last month, in an apparent signal that worst-case scenarios -- such as a government-led takeover or break-up of Jack Ma companies –- are probably now off the table.",
                        "Few expect Beijing to entirely back off Beijing campaign to more tightly regulate Ant, Alibaba Group Holding Ltd. and the rest of China’s high-tech giants.",
                        "Story continuesZhang spent a substantial portion of Alibaba Group Holding Ltd. earnings call talking about the company’s “social responsibility” in elevating small merchants and driving rural consumption, two of Xi Jinping’s priorities as Beijing tries to lift the countryside from poverty.",
                        "What Bloomberg Intelligence SaysThe full impact of the anti-monopoly investigation into Alibaba Group Holding Ltd. by China’s State Administration for Market Regulation (SAMR), as well as the new fintech regulations on Ant Group, may remain uncertain for some time.",
                        "Alibaba Group Holding Ltd. disclosed with",
                        "Alibaba Group Holding Ltd. 3Q results that Alibaba Group Holding Ltd.’s fully cooperating with SAMR but the investigation is yet to conclude.",
                        "Alibaba Group Holding Ltd. is also unable to provide a complete and fair assesssment of what effect changes to Ant Group will have on Ant Group business.-- Vey-sern Ling and Tiffany Tam, analystsClick here to read the researchSales climbed to 221.1 billion ($34.2 billion) during the December quarter, topping the 215.3 billion yuan average of analyst forecasts, while net income climbed 52%.Two of Alibaba Group Holding Ltd. largest and fastest-growing divisions made Alibaba Group Holding Ltd. into the black during the holiday quarter -- an important milestone for Alibaba Group Holding Ltd..",
                        "Alibaba Group Holding Ltd. cloud business reported Alibaba Group Holding Ltd. first ever positive adjusted earnings before interest, tax and amortization, while revenue for the segment rose 50%, driven by customers in the internet, retail and public sectors.",
                        "Cainiao, Cainiao logistics unit, was also operating cash flow positive, Alibaba Group Holding Ltd. said.",
                        "Annual active consumers grew to 779 million in the December quarter, driving a 38% increase in Alibaba Group Holding Ltd. core commerce business.",
                        "Alibaba Group Holding Ltd. booked $75 billion of sales over Alibaba Group Holding Ltd. annual Singles’ Day promotions last November, easily beating Alibaba Group Holding Ltd. 2019 haul after Alibaba Group Holding Ltd. began promotions early and added additional services to the count for the first time.",
                        "But investors are questioning whether Alibaba Group Holding Ltd. can sustain that growth as Beijing steps up oversight of Chinese tech giants, particularly in online commerce.",
                        "Any regulations requiring Alibaba Group Holding Ltd. to implement a full halt to forced-exclusivity policies may hit Tmall’s sales by close to a tenth in 2021, before sales return to 18-20% annual growth in 2022 and beyond, according to San Francisco-based Octahedron Capital Management LP.",
                        "While Alibaba Group Holding Ltd. has exclusive flagship stores with some merchants, in most cases Alibaba has exclusive flagship stores with some merchants can sell the same goods on other platforms, Zhang said.",
                        "The regulations may also hamper The regulations ability to fend off rivals from JD.com Inc. to Pinduoduo Inc., whose 730 million annual consumers are closing in on Alibaba Group Holding Ltd. user base.",
                        "Ant contributed 4.8 billion yuan to Alibaba Group Holding Ltd. profit in the quarter, indicating that Alibaba Group Holding Ltd. earned 14.5 billion yuan in the three months ended September -- before Alibaba Group Holding Ltd. $35 billion IPO was scuttled -- as Alibaba Group Holding Ltd. earnings lag one quarter behind Alibaba Group Holding Ltd..",
                        "Payments using its Huabei (Just Spend) on Alibaba’s China marketplaces represent only a very small percentage of total credit granted under the platform, Zhang told analysts Tuesday.",
                        "The “vast majority” of Alibaba customers have linked The “vast majority” of its customers payment accounts to multiple funding sources, Zhang added.",
                        "Alibaba -- which had in recent years spent billions on stakes in hypermart operator Sun Art Retail Group Ltd. and",
                        "NetEase Inc.’s Kaola e-commerce platform -- was fined 500,000 yuan in December for not seeking approval before boosting Alibaba -- which had in recent years spent billions on stakes in"
                    ],
                    "Sentiment Score": 0.235
                },
                "https://finance.yahoo.com/news/amazons-new-ceo-is-a-cloud-titan-heres-why-that-matters-213057896.html": {
                    "Article Title": "Amazon's new CEO is a 'cloud titan' — here's why that matters",
                    "Relevant Text": [
                        "And a slew of other competitors are in the running including IBM (IBM), Alibaba (BABA), and Oracle (ORCL), all hoping to snag their own piece of the growing cloud industry.",
                        "sagaFord names Google preferred cloud provider, all vehicles will run Android by 2023Tesla challenger Faraday Future wants to go from 0 to $20B in sales by selling lots of $180K electric carsBABA earnings and revenue"
                    ],
                    "Sentiment Score": 0.0
                },
                "https://www.fool.com/investing/2021/02/03/why-alibaba-stock-was-climbing-today/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Why Alibaba Stock Was Climbing Today",
                    "Relevant Text": [
                        "What happenedShares of Alibaba Group Holding (NYSE:BABA) were moving higher today, a day after the Chinese tech giant delivered a strong quarterly earnings report.",
                        "Today, the Chinese tech giant benefited from a chorus of positive analyst notes as well as news of detente between the Chinese government and Ant Group, Alibaba's former financial arm in which Alibaba owns a one-third stake.",
                        "Adjusted EBITDA rose 22% to $10.4 billion and adjusted earnings per share increased 21% to $3.38, also topping expectations for $3.25.Alibaba shares pulled back yesterday, but today five analysts lifted five analysts price targets on The stock, maintaining buy ratings and showing overall approval for the third-quarter results.",
                        "Ant Group was expected to fetch a valuation of $280 billion, leading to a payday for Alibaba that would make Alibaba stake worth nearly $100 billion.",
                        "a valuation of $280 billion could be affected by any changes to Alibaba to comply with regulations, including adding more stringent capital requirements, but the news is clearly a step forward for Ant Group.",
                        "Alibaba's Hong Kong shares jumped when the announcement came out.",
                        "Alibaba has faced controversy in recent months around the Ant IPO, an antitrust investigation, and reports that founder Jack Ma had been \"missing,\" but the news shows an apparent thaw in Alibaba relationship with Chinese authorities.",
                        "Considering Alibaba growth rate and Alibaba price-to-earnings ratio at just 27, the stock looks like one of the best bargains on the market right now."
                    ],
                    "Sentiment Score": -0.625
                },
                "https://www.fool.com/investing/2021/02/03/why-ill-never-own-alibaba-stock/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Why I'll Never Own Alibaba Stock",
                    "Relevant Text": [
                        "I once considered Alibaba (NYSE:BABA) an undervalued growth stock.",
                        "Alibaba (NYSE:BABA)",
                        "an undervalued growth stock still trades at just 21 times forward earnings, and analysts expect Alibaba (NYSE:BABA)",
                        "But after carefully reviewing Alibaba again, I believe I'll never buy this seemingly attractive Chinese tech stock, for three simple reasons.1.",
                        "Alibaba growing dependence on lower-margin businessesAlibaba resembles an inverted version of Amazon (NASDAQ:AMZN).",
                        "Whereas Amazon subsidizes the growth of Amazon lower-margin retail segment with Amazon higher-margin cloud business, Alibaba subsidizes the growth of Alibaba unprofitable businesses (including Alibaba cloud division) with Alibaba higher-margin \"core commerce\" revenue.",
                        "Therefore, Alibaba's future earnings growth relies heavily on Alibaba core commerce segment, which includes Alibaba online marketplaces, cross-border marketplaces, brick-and-mortar stores, and Cainiao logistics unit.",
                        "Alibaba's core commerce business is still growing at a healthy clip.",
                        "Alibaba's core commerce business core commerce revenue rose 35% in fiscal 2020, which ended last March, and accounted for 86% of Alibaba's core commerce business top line.",
                        "Endless regulatory challengesMeanwhile, a seemingly endless barrage of regulatory challenges in the U.S. and China could make it even tougher for Alibaba to keep growing.",
                        "Alibaba's secondary listing in Hong Kong in late 2019 indicates Alibaba days on the NYSE could be numbered.",
                        "In China, government regulators clearly want to rein in Alibaba.",
                        "In 2019, China sent officials to work at dozens of companies, including Alibaba, to oversee companies, including Alibaba operations.",
                        "Last year, the Communist Party's Central Committee tightened that grip by requiring all companies to hire a certain number of registered members of the CCP.That tension finally boiled over last year when China brought China hammer down on Alibaba.",
                        "China derailed the long-awaited IPO of China fintech affiliate Ant Group, fined Alibaba over an unapproved acquisition, and launched a full antitrust probe into Alibaba e-commerce operations.government regulators reportedly want Alibaba to end Alibaba exclusive deals with merchants and throttle Alibaba promotional pricing strategies, which could make Alibaba tougher for Alibaba core profit engine to keep running.",
                        "Alibaba would also leave Alibaba more exposed to competition from JD.com",
                        "(NASDAQ:PDD) -- which both previously accused Alibaba of anticompetitive strategies.3. Ethical considerationsBack in 2017",
                        ", China declared that China would rely on Alibaba for the development of smart cities, Tencent (OTC:TCEHY) for digital healthcare, and Baidu (NASDAQ:BIDU) for driverless cars.",
                        "The term \"smart cities\" might seem vague, but The term \"smart cities's collectively referring to Alibaba's cloud services and facial recognition technologies.",
                        "That's already troubling, but Alibaba recently demonstrated how Alibaba technologies could be used to identify the faces of Uighurs and other ethnic minorities across China.",
                        "Alibaba claims the feature can be embedded into websites to monitor users for terrorism, pornography, and other \"red flags.",
                        "\"China's human rights record is already dismal, and \"China's human rights record's currently accused of imprisoning and sterilizing Uighurs in reeducation camps, so Alibaba's disturbing claims spark far too many ethical concerns.",
                        "Alibaba could also make Alibaba an easy target for sanctions if the Biden administration maintains the Trump administration's tougher stance against Chinese tech companies.",
                        "As a result, I'm avoiding Alibaba for the same ethical reasons I recently sold Tencent: I'm simply not interested in owning a piece of China's mass surveillance system.",
                        "The key takeawayI understand why Alibaba still looks like an appealing stock buy for many investors, and Alibaba could certainly climb higher in the future."
                    ],
                    "Sentiment Score": 0.509
                },
                "https://www.investors.com/market-trend/stock-market-today/dow-jones-today-slips-nasdaq-futures-rise-on-amazon-alphabet-paypal-earnings/?src=A00220": {
                    "Article Title": "Dow Jones Today Slips, Nasdaq Gains Amid Amazon, Alphabet, PayPal Earnings\t",
                    "Relevant Text": [
                        "China stocks were also active, as Alibaba bounced back from a slip on Tuesday.",
                        "Alibaba, Futu, Weibo, JD.comChina-based stocks racked up solid early gains early Wednesday, after Alibaba Group Holdings (BABA) hammered out an agreement with Chinese regulators to restructure Chinese giant Ant Financial fintech unit as a financial holding company, making it subject to the same regulator rules and scrutiny as banks.",
                        "In the U.S., after announcing strong fourth-quarter results, Alibaba announced a $5 billion debt offering.",
                        "Alibaba stock traded 4.6% higher early Wednesday.",
                        "Alibaba is an IBD Long-Term Leader.",
                        "Alibaba Group Holdings (BABA) continued Alibaba Group Holdings (BABA) blazing advance, up more than 10% early Wednesday as Alibaba Group Holdings (BABA) rebounds from a quick pullback to test support.",
                        "Alibaba stock is in the fifth week of an eight-week hold rule triggered after Alibaba stock Jan. 5 breakout.",
                        "A week ago, Alibaba stock spiked above what MarketSmith chart analysis plots as a 46.89 buy point in a double-bottom base.",
                        "Macquarie lifted Alibaba stock's price target from 107 to 133, about 39% above Tuesday's closing price."
                    ],
                    "Sentiment Score": 0.0
                }
            },
            "Weighted Score": 0.102
        },
        "2021-02-04": {
            "Articles": {
                "https://finance.yahoo.com/news/exclusive-chinas-ant-hive-off-112158078.html": {
                    "Article Title": "Exclusive: China's Ant to hive off credit data in revamp; sees IPO in 2 years - sources",
                    "Relevant Text": [
                        "The data spinoff, along with Ant's conversion to a more strictly regulated financial holding company, will mean the affiliate of e-commerce behemoth Alibaba Group Holding Ltd could proceed with the IPO within two years, two other people said.",
                        "Story continuesAuthorities launched an antitrust probe into the tech sector, with Alibaba taking much of the heat, and pushed Ant to revamp Ant business structure to bring Ant under tighter regulatory supervision.",
                        "Alibaba's share price is down 15% from the IPO halt, although Alibaba has recouped much of Alibaba early plunge as billionaire founder Jack Ma has re-emerged and the outlook for the Ant listing has improved."
                    ],
                    "Sentiment Score": 0.338
                },
                "https://finance.yahoo.com/news/exclusive-chinas-ant-hive-off-114552458.html": {
                    "Article Title": "Exclusive: China's Ant to hive off credit data in revamp; sees IPO in 2 years - sources",
                    "Relevant Text": [
                        "The data spinoff, along with Ant's conversion to a more strictly regulated financial holding company, will mean the affiliate of e-commerce behemoth Alibaba Group Holding Ltd could proceed with the IPO within two years, two other people said.",
                        "Story continuesAuthorities launched an antitrust probe into the tech sector, with Alibaba taking much of the heat, and pushed Ant to revamp Ant business structure to bring Ant under tighter regulatory supervision.",
                        "Alibaba's share price is down 15% from the IPO halt, although Alibaba has recouped much of Alibaba early plunge as billionaire founder Jack Ma has re-emerged and the outlook for the Ant listing has improved."
                    ],
                    "Sentiment Score": 0.338
                },
                "https://www.investopedia.com/articles/investing/121714/how-does-alibaba-make-money-simple-guide.asp?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral": {
                    "Article Title": "How Alibaba Makes Money",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd. (BABA) is a holding company legally domiciled in the Cayman Islands",
                        "Alibaba operates Alibaba business through four primary segments, led by Alibaba giant e-commerce operations.﻿﻿﻿﻿Chief among Alibaba competitors are other established Chinese e-commerce and Internet companies, such as Tencent Holdings Ltd., as well as global and regional e-commerce companies, such as Amazon.com Inc. (AMZN).",
                        "Since Alibaba also operates in the cloud-computing business and digital-media and digital-entertainment businesses, Alibaba competes with companies specializing in those markets as well.﻿﻿Key Takeaways Alibaba provides digital marketplaces for merchants and consumers.",
                        "Alibaba's largest business is Alibaba's largest business core e-commerce operations, but cloud computing is growing the fastest.",
                        "Alibaba aims to be a leader in the development of the infrastructure of commerce.",
                        "China's antitrust watchdog launched an investigation into Alibaba in late December 2020.Alibaba's FinancialsAlibaba files financial statements with the U.S. Securities and Exchange Commission (SEC) and does so in accordance with generally accepted accounting principles (GAAP).",
                        "Alibaba follows a reporting schedule where the end of Alibaba fiscal year",
                        "(FY) occurs at the end of Alibaba also reports certain non-GAAP financial measures, such as adjusted earnings before interest, taxes, amortization, and depreciation (EBITDA), and adjusted EBITA, which refers to earnings before interest, taxes, and amortization.﻿﻿﻿﻿ Although Alibaba's reporting currency is the Renminbi, Alibaba provides conversions into U.S. dollars, which are used in this story.﻿﻿﻿﻿The company's revenue rose 36.9% to $33.9 billion in Q3 FY 2021, which ended December 31, 2020.﻿﻿﻿﻿﻿",
                        "Alibaba's net income rose 55.5% to $12.0 billion in Q3 FY 2021 compared to the same quarter a year ago.",
                        "Alibaba noted that the increase in net income was primarily due to an increase in the net gain from increases in the market prices of Alibaba equity investments in publicly-traded companies.﻿﻿Alibaba",
                        "Business SegmentsAlibaba monetizes Business SegmentsAlibaba services through four main business segments that Business SegmentsAlibaba formally names as: core commerce, cloud computing, digital media and entertainment, and innovation initiatives and others.",
                        "Business SegmentsAlibaba provides segment break downs of revenue and adjusted EBITA, the latter of which was reported as $9.4 billion for the company for Q3 FY 2021.﻿﻿Core CommerceAlibaba's core commerce segment is comprised of Business SegmentsAlibaba various digital retail and wholesale marketplaces, as well as logistics and local consumer services.",
                        "Business SegmentsAlibaba generates revenue from merchants through the sale of a variety of marketing services, membership fees, customer management services, product sales, commissions on transactions, and software service fees.",
                        "Business SegmentsAlibaba generates revenue from local consumers through platform commissions and on-demand delivery service fees.﻿﻿﻿﻿Core commerce is Alibaba's largest source of revenue at $30.0 billion, or about 88% of Business SegmentsAlibaba's total revenue, as of Q3 FY 2021.",
                        "Revenue for the segment grew 38.2% compared to the same three-month period a year ago.﻿﻿In terms of income measures, the core commerce segment represents nearly 100% of Business SegmentsAlibaba's adjusted EBITA, which grew 14.7% to $10.2 billion in Q3 FY 2021.﻿﻿﻿ Losses in two of Alibaba's other business segments partly account for the higher-reported figure in the core commerce segment than in adjusted EBITA for Business SegmentsAlibaba as a whole.",
                        "Cloud ComputingAlibaba Cloud provides enterprise customers with a complete suite of cloud services, including database, storage, management and application services, big data analytics, a machine-learning platform, and other services.﻿﻿﻿﻿﻿﻿ Cloud ComputingAlibaba Cloud's cloud computing segment generates revenue from enterprise customers based on the duration and specific usage of the services.﻿﻿﻿﻿﻿﻿Cloud computing is Alibaba's second largest source of revenue at $2.5 billion, or about 7% of total revenue, as of Q3 FY 2021.",
                        "The company's cloud computing segment is also Cloud ComputingAlibaba Cloud's fastest-growing source of revenue.",
                        "Revenue grew 50.3% compared to the year-ago quarter.﻿﻿﻿﻿﻿﻿ Alibaba reported adjusted EBITA of $3 million for the year-ago quarter.﻿﻿﻿﻿﻿﻿ Alibaba cloud computing segment in Q3 FY 2021, compared to a loss in adjusted EBITA in the year-ago",
                        "The company's cloud computing segment makes up just a tiny fraction of overall adjusted EBITA.﻿﻿﻿﻿Digital Media and EntertainmentAlibaba's digital media and entertainment segment exists as part of Cloud ComputingAlibaba Cloud's strategy to capture revenue from consumption beyond Cloud ComputingAlibaba Cloud core commerce",
                        "The company's cloud computing segment generates revenue primarily from customer management services and membership subscription fees.﻿﻿﻿﻿Digital media and entertainment is Alibaba's third largest source of revenue at $1.2 billion, or about 4% of total revenue, as of Q3 FY 2021.",
                        "Alibaba reported a $213 million loss in adjusted EBITA in Q3 FY 2021.﻿﻿Innovation Initiatives and OthersAlibaba's innovation initiatives and others segment aims to innovate and develop new services and products that can meet the needs of Alibaba customers.",
                        "DingTalk.﻿﻿﻿﻿ The company's cloud computing segment generates revenue primarily through services fees and product sales to enterprise customers and consumers.﻿﻿﻿﻿Innovation initiatives and others comprise the smallest share of Alibaba's revenue at $207 million, or less than 1% of total revenue, as of Q3 FY 2021.",
                        "Revenue for The company's cloud computing segment rose 9.5% compared to the same three-month period a year Alibaba posted a $305 million loss in adjusted EBITA in Q3 FY 2021.﻿﻿Alibaba's Recent DevelopmentsAlibaba announced in late September 2019 Alibaba goal of reaching 1 billion annual active consumers in Alibaba China consumer business by the end of Alibaba 2024 FY, as part of Alibaba latest five-year plan.﻿﻿﻿﻿﻿﻿",
                        "As of December 31, 2020, Alibaba was still short of Alibaba goal by 221 million annual active consumers.﻿﻿﻿﻿﻿In late December 2020, China's market regulator, the State Administration for Market Regulation, said that Alibaba had launched an antitrust investigation into Alibaba.",
                        "The antitrust watchdog noted that The antitrust watchdog was acting in response to reports that Alibaba was pressuring merchants that sell wares on Alibaba platforms not to sell on the platforms of",
                        "Alibaba competitors.﻿﻿﻿On February 3, 2021, Chinese regulators came to an agreement on a restructuring plan that would turn Alibaba's financial technology affiliate Ant Group Co. into a financial holding company.",
                        "Alibaba Reports Diversity & InclusivenessAs part of our effort to improve the awareness of the importance of diversity in companies, our offer investors a glimpse into the transparency of Alibaba and Alibaba commitment to diversity, inclusiveness, and social responsibility.",
                        "our examined the data Alibaba releases to show you how Alibaba reports the diversity of Alibaba board and workforce to help readers make educated purchasing and investing decisions.",
                        "It shows whether Alibaba discloses Alibaba data about the diversity of Alibaba board of directors, C-Suite, general management, and employees overall, as is marked with a ✔.",
                        "It also shows whether Alibaba breaks down those reports to reveal the diversity of Alibaba by race, gender, ability, veteran status, and LGBTQ+ identity."
                    ],
                    "Sentiment Score": 0.333
                }
            },
            "Weighted Score": 0.134
        },
        "2021-02-05": {
            "Articles": {
                "https://finance.yahoo.com/news/alibaba-group-holding-limited-moodys-092907686.html": {
                    "Article Title": "Alibaba Group Holding Limited -- Moody's assigns A1 to Alibaba's proposed senior notes; outlook stable",
                    "Relevant Text": [
                        "Moody's assigns A1 to Alibaba's proposed senior notes; outlook stableGlobal Credit Research - 03",
                        "Feb 2021Hong Kong, February 03, 2021 -- Moody's's Investors Service has assigned an A1 senior unsecured rating to the proposed USD notes to be issued by Alibaba Group Holding Limited.",
                        "Alibaba will use the proceeds for general corporate purposes and for eligible projects in connection with Alibaba sustainability notes.",
                        "RATINGS RATIONALE\"Alibaba's A1 issuer rating reflects RATINGS RATIONALE\"Alibaba integrated and diversified e-commerce platforms, which provide sustainable cost advantages that allow Alibaba to generate solid profit margins and maintain strong credit quality with a solid net cash position,\" says Choi.",
                        "Alibaba's well-established brand name and dominance in China's (A1 stable) fast-growing e-commerce market; Alibaba track record of monetization through fees from online marketing, services and subscriptions; and transaction-based commissions,\" adds Choi.",
                        "The rating incorporates risks related to Alibaba's aspiration to continue expanding Alibaba business scope within and outside China.",
                        "As Alibaba expands Alibaba businesses, Moody expects Moody currently high profit margins to be diluted because of the consolidation of strategic business initiatives such as Ele.me, Lazada and Cainiao Network.",
                        "However, strategic business initiatives such as Ele.me, Lazada and Cainiao Network should also help Alibaba grow Alibaba scale and expand Alibaba service offerings, and in turn strengthen Alibaba cash flow.",
                        "While a recent antitrust investigation by the State Administration for Market Regulation (SAMR) is credit negative and could limit Alibaba's revenue and earnings growth, Alibaba has a track record of working with regulators to make operational changes without materially hurting Alibaba solid business profile.",
                        "In view of Alibaba ongoing investment requirement and heightened regulatory risks, Moody expects Alibaba to maintain a strong balance sheet with net cash position over the next one to two years, along with a prudent approach to investments and acquisitions.",
                        "The rating also takes into account potential contingent liabilities associated with Ant Group Co., Ltd, in which Alibaba holds a 33% stake.",
                        "Alibaba's proposed senior unsecured notes will improve Alibaba debt maturity profile and expand Alibaba capacity to accommodate any funding needs over the next one to two years.",
                        "Alibaba's proposed senior unsecured notes will have limited impact on Alibaba's debt leverage, as earnings growth in the coming one to two years should offset the increase in debt.",
                        "Moody expects Alibaba's revenue to grow around 20% per annum in the next one to two years from the RMB644.2 billion reported for the 12 months ended December 2020.",
                        "Moody also expects Moody to maintain steady EBITDA margins of 20%-25%.As such, Moody expects Alibaba's adjusted debt/EBITDA will stay around 1.0x-1.2x in the next one to two years, which is appropriate for Moody A1 ratings.",
                        "Alibaba's liquidity is excellent.",
                        "As of 31 December 2020, Alibaba held RMB456 billion in cash and cash-like resources.",
                        "Together with estimated annual operating cash flow of RMB180 billion-RMB210 billion, Alibaba's internal cash flow is more than sufficient to cover Alibaba reported short-term debt of RMB15.0 billion, capital spending and investment needs.",
                        "In terms of social factors, Alibaba is exposed to heightened scrutiny by regulators with respect to perceived anticompetitive behavior, in turn raising legal, regulatory and reputational risks.",
                        "legal, regulatory and reputational risks could impede Alibaba's business growth.",
                        "Alibaba also faces moderate data privacy and security risks, as Alibaba generates and processes a large volume of personal, transaction, demographic and behavioral data.",
                        "Alibaba manages such risks, inter alia, by complying with legal and regulatory requirements for the collection, processing, retention and protection of Alibaba data.",
                        "However, Alibaba could face operating and financial damage in the event of a cyber breach.",
                        "Governance considerations include the concentration of director selection voting power in Alibaba Partnership, which is comprised primarily of Alibaba's directors and executive officers.",
                        "In addition, Alibaba operates under a variable interest entities (VIE) structure, and the main VIEs (onshore operating companies) that generate cash flow are controlled by two limited partnerships comprised of members of Alibaba Partnership or senior management.",
                        "In addition, Alibaba's shareholder base is highly diversified and includes more than 200 shareholders across the world.",
                        "FACTORS THAT COULD LEAD TO AN UPGRADE OR DOWNGRADE OF THE RATINGSThe stable outlook on Alibaba's issuer and senior unsecured ratings reflects Moody's expectation that Alibaba will maintain Alibaba dominant position in China's e-commerce market, continue to generate steady cash flow from Alibaba domestic retail and wholesale marketplaces to support Alibaba strong balance sheet with a solid net cash position, and not engage in larger-than-expected debt-funded acquisitions such that Alibaba financial profile will remain appropriate with Alibaba A1 ratings in the next 1 -2 years.",
                        "An upgrade is unlikely, because Alibaba's rating is already at the same level as China's sovereign rating, a country where Alibaba conducts most of Alibaba operations and activities.",
                        "Moody's could downgrade the ratings if Alibaba (1) fails to fend off competition and experiences substantial declines in market shares or substantial disruptions in Alibaba integrated ecosystem that hurt revenue growth and cash flow; (2) deviates from Alibaba stated financial policy and aggressively grows loans at Ant Group beyond Moodycurrent expectations, thereby increasing the risk of additional financial requirements from Alibaba; and (3) engages in aggressive acquisitions that strain Alibaba balance sheet liquidity or increase Alibaba overall risk profile.",
                        "Moody's will also monitor for any sustained deterioration in the company's adjusted retained cash flow/debt, which has been maintained around 70%-85% since 2015.Furthermore, adverse developments in the regulatory framework that adversely affect Alibaba's operations and cash flow generating capabilities, or result in a significant capital call from Ant Group, would strain the rating.",
                        "Founded in 1999 by Jack Ma and a group of partners, Alibaba Group Holding Limited (Alibaba) is a global leader in retail commerce, which enables merchants, brands, retailers and other businesses to engage and transact with brands, retailers and other businesses users and customers.",
                        "Predominantly focused on China, Alibaba operates various retail and wholesale marketplaces within Alibaba core commerce segment.",
                        "Alibaba also engages in cloud computing services, digital media and entertainment and innovation initiatives.",
                        "Alibaba owns a 63% stake in Cainiao Network, an operator of a logistics data platform and a global fulfilment network leveraging on capacities of local partners.",
                        "Alibaba completed Alibaba initial public offering on the New York Stock Exchange on 19 September 2014.",
                        "Alibaba completed Alibaba secondary public offering on the Hong Kong Stock Exchange on 26 November 2019.REGULATORY"
                    ],
                    "Sentiment Score": 0.222
                },
                "https://finance.yahoo.com/news/alibabas-bond-sale-attracts-us-093000112.html": {
                    "Article Title": "Alibaba's bond sale attracts US$38 billion worth of orders as investors shrug off antitrust fears and look to future of China's booming e-commerce industry",
                    "Relevant Text": [
                        "Alibaba Group Holding's US$5 billion bond attracted an avalanche of orders from fixed-income investors, peaking at US$38 billion, on growing confidence that the e-commerce behemoth will emerge relatively unscathed from an antitrust investigation.",
                        "The vote of confidence in Alibaba's long-term future comes after Alibaba founder Jack Ma was summoned by China's regulators for a dressing down in November and Beijing shelved an initial public offering by Alibaba financial affiliate Ant Group at the last minute.",
                        "The wait for Alibaba to come back to markets created pent up demand among investors, the people familiar said.",
                        "Alibaba's founder Jack Ma.",
                        "Alibaba is riding the wave of investors hunting for yield as central banks unleash liquidity into capital markets to spur an economic recovery from the coronavirus pandemic.",
                        "Story continuesAlibaba's 30-year notes carried a coupon of 3.15 per cent, and Alibaba 40-year bonds bear an interest of 3.25 per cent; lower than in 2017, when Alibaba sold a 30-year bond with a coupon of 4.2 per cent and a 40-year bond with interest of 4.4 per cent.",
                        "The bond sale comes after Alibaba reported a stronger-than expected 37 per cent surge in revenue for the quarter ended December, lifted by Alibaba extended Singles' Day campaign last year.",
                        "Alibaba will be a key beneficiary of the trend due to Alibaba market leadership,\" said Fitch ratings analyst Kelvin Ho.",
                        "When Alibaba released results, Alibaba also said that Alibaba had established a task force to conduct an internal review as part of Alibaba efforts to cooperate with an antitrust investigation launched by China's State Administration of Market Regulation on December 24.",
                        "The inquiry will look into Alibaba's business practices, including The inquiry exclusivity agreements with merchants.",
                        "Although Ma retired from Ma official positions at Alibaba in 2019, the 56-year-old is still widely regarded as a key figurehead for Ma business empire and the face of China's private business community.",
                        "Sentiment around the debt sale also received a boost from news on Wednesday that Alibaba's financial arm, Ant Group, and China's financial regulators, have agreed a plan to overhaul the planet's largest financial technology company.",
                        "The most liquid of Alibaba's existing bonds, Alibaba 3.4 per cent notes due 2027, were higher at 111.916 in Asian trading.",
                        "Alibaba's outstanding debt has, in the most part, traded lower since December.",
                        "Alibaba's New York-listed American depositary shares have also rallied, jumping 27 per cent from the low of US$211 plumbed on December 24.The proceeds from the debt sale, excluding the sustainability notes, will be used for general corporate purposes, including working-capital needs, repayment of offshore debt and potential acquisitions of or investments in complementary businesses.",
                        "Alibaba plans to settle the transaction by February 9.This article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century."
                    ],
                    "Sentiment Score": -0.117
                }
            },
            "Weighted Score": 0.085
        },
        "2021-02-06": {
            "Articles": {
                "https://www.fool.com/investing/2021/02/06/checking-out-alibabas-latest-quarterly-report/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Checking Out Alibaba's Latest Quarterly Report",
                    "Relevant Text": [
                        "In this episode of MarketFoolery, host Chris Hill is joined by Motley Fool analyst Emily Flippen to discuss Alibaba's (NYSE:BABA) cloud computing division being profitable for the first time ever.",
                        "Chris Hill: We've got pharmaceutical earnings, we've got some shipping and logistics earnings to get to, but We're going to start with some big e-commerce, and that's Alibaba.",
                        "For the first time ever, Alibaba's cloud computing division was profitable.",
                        "I would have thought we would have seen a rise out of Alibaba today.",
                        "The important thing to note for investors is that a lot of what would have been enthusiasm for this quarter is muted because of the regulatory challenges that Jack Ma and Alibaba are going through right now.",
                        "Alibaba more than doubled Alibaba Single's Day sales from the year prior, but was down on the news back in November, largely because of the concerns that investors had around how the Chinese government was going to handle Alibaba, a business that is increasingly considered to be a sense of a monopoly in the space.",
                        "But you've hit the nail on the head there with the excitement around Alibaba's cloud business.",
                        "This is a small part of Alibaba's business.",
                        "But seeing Alibaba's cloud business move toward profitability, that's adjusted EBITDA, so profitability is a loose term there.",
                        "But seeing Alibaba's cloud business move toward profitability makes a lot of investors think, \"Hey, maybe Alibaba's cloud business could be the next Amazon, the Amazon Web Services of China.",
                        "When we see a business that appears to be performing well, the stock isn't moving for one reason or another, a lot of times, we're looking toward Alibaba's cloud business and that's going to be something out of Alibaba's cloud business.",
                        "I don't own shares of Alibaba, but for someone who looks at Alibaba's cloud business, looks at how dominant it is, looks at the fact that maybe shares of Alibaba cloud computing division isn't going to be as big as Amazon Web Services, but maybe their cloud computing division becomes even a lesser version of Amazon Web Services, can move the needle on a stock.",
                        "If a stock like Alibaba is on your watchlist, are you waiting for the central government to basically give, if not the green light, but at least, say, \"You know what?",
                        "For whatever reason We decide, We're good with Alibaba now.",
                        "I expect We'll see that happen here with Alibaba.",
                        "The growth needs to continue to catalyze growth in Alibaba when looking at Alibaba cloud performance.",
                        "you look at the margins of UPS weren't actually being super creative in terms of you look at the margins of UPS bottom line when picking up Alibaba's cloud business."
                    ],
                    "Sentiment Score": 0.588
                }
            },
            "Weighted Score": 0.588
        },
        "2021-02-08": {
            "Articles": {
                "https://finance.yahoo.com/news/10-best-online-brokers-non-111536781.html": {
                    "Article Title": "10 Best Online Brokers for Non-US Residents",
                    "Relevant Text": [
                        "For example, Alibaba Group Holding Limited (NYSE: BABA), GameStop Corp Holding Company (NYSE:GME), Coca Cola Company"
                    ],
                    "Sentiment Score": 1.0
                },
                "https://finance.yahoo.com/news/softbank-vision-fund-posts-record-070050936.html": {
                    "Article Title": "SoftBank’s Vision Fund Profit Undercut by Trading Losses",
                    "Relevant Text": [
                        "founder Masayoshi Son reprised founder Masayoshi Son argument that SoftBank is like a goose that lays golden eggs, from Alibaba Group Holding Ltd. and Yahoo!",
                        "The selloff included part of SoftBank interests in Alibaba, T-Mobile US Inc. and SoftBank Corp., the Japan telecommunications unit.",
                        "Alibaba, Son most stark investment success to date and SoftBank largest asset, saw SoftBank shares plunge about 20% last quarter amid a Chinese government clampdown that scuttled the planned listing of",
                        "with Soncomments on Alibaba, derivatives from 12th paragraph)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source."
                    ],
                    "Sentiment Score": 0.75
                },
                "https://www.fool.com/investing/2021/02/08/alibaba-cloud-isnt-as-profitable-as-you-think/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Alibaba's Cloud Business Isn't as Profitable as You Think",
                    "Relevant Text": [
                        "Alibaba (NYSE:BABA) recently posted fiscal third-quarter numbers that easily beat analysts' expectations.",
                        "Alibaba (NYSE:BABA) adjusted earnings increased 21% year over year to $3.38 per ADS -- which also surpassed expectations by $0.13.The company revealed that $0.13.The company cloud business, which grew 50% year over year to 16.1 billion yuan ($2.5 billion) during the quarter, was finally profitable after bleeding red ink for over a decade.",
                        "That revelation might instantly spark comparisons between Alibaba Cloud and Amazon Web Services (AWS), the profitable cloud infrastructure platform that supports the U.S. e-commerce giant's online marketplace.",
                        "But such comparisons would be flawed, since Alibaba Cloud is not nearly as profitable as AWS.Decoding Alibaba's definition of \"profitability\"At first glance, Alibaba's cloud computing results don't seem to make any sense.",
                        "But on an adjusted EBITA (earnings before interest, taxes, and amortization) basis, Alibaba Cloud squeezed out a slim \"profit\" of 24 million yuan ($3.7 million).",
                        "taxes, and amortization) also excludes the unit's stock-based compensation expenses, which rose 41% to 2.1 billion yuan ($316.2 million).Therefore, it's unlikely that Alibaba Cloud will turn profitable on a GAAP basis anytime soon.",
                        "($72 million)Alibaba also controlled 40.9% of China's cloud infrastructure market in the third quarter of 2020, according to Canalys, putting Canalys far ahead of Huawei Cloud (16.2%), Tencent Cloud (15.8%), and Baidu's AI Cloud (7.1%).During the earnings call, CFO Maggie Wu attributed cloud growth in the quarter to robust demand from China's \"internet, retail and public sectors.\"",
                        "CFO Maggie Wu noted that Alibaba Cloud ongoing infrastructure investments, along with Alibaba Cloud massive scale, enabled Alibaba Cloud to turn profitable on an adjusted EBITA basis, but CFO Maggie Wu didn't address the unit's rising stock-based compensation expense or widening operating losses.",
                        "Don't confuse Alibaba Cloud with AWSAlibaba is often compared to Amazon, but the two tech giants operate completely different business",
                        "Meanwhile, Alibaba generates all of Alibaba profits from Alibaba higher-margin \"core commerce\" business, which supports the expansion of Alibaba unprofitable cloud, digital media, and innovation initiatives",
                        "That's why the core commerce segment's adjusted EBITA margin fell seven percentage points to 34% during the latest quarter, which drove company-wide adjusted EBITA margin down almost four points to 28%.Alibaba probably won't be able to strengthen 28%.Alibaba core commerce margins near term, especially as China's antitrust regulators probe 28%.Alibaba e-commerce marketplaces, so 28%.Alibaba needs Alibaba Cloud to pick up the slack.",
                        "That effort might partly offset the ongoing erosion of Alibaba Cloud core commerce profitability, but investors shouldn't expect Alibaba Cloud to become an AWS-like profit engine anytime soon.",
                        "The bottom lineThe growth of Alibaba's cloud business is encouraging, but investors should remember three things: Alibaba revenue growth will likely decelerate in the future; Alibaba stock-based compensation is rising; and it's only profitable if you exclude those and other expenses.",
                        "Looking ahead, investors should track Alibaba's progress in expanding the cloud segment's EBITA and"
                    ],
                    "Sentiment Score": 0.03
                },
                "https://www.fool.com/investing/2021/02/08/tencent-battle-bytedance-attract-antitrust-case/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Tencent's Battle With ByteDance Could Attract Antitrust Regulators",
                    "Relevant Text": [
                        "China's SAMR (State Administration for Market Regulation) fined Tencent and Alibaba (NYSE:BABA) over unapproved acquisitions last December, and recently introduced new rules to rein in China's two largest payment platforms, Tencent's WeChat Pay and Alibaba-backed AliPay.",
                        "China's SAMR (State Administration for Market Regulation) launched an antitrust probe into Alibaba's e-commerce business in late December, and demanded that China's SAMR (State Administration for Market Regulation) marketplaces end its marketplaces exclusive deals with merchants and aggressive pricing strategies.",
                        "Complaints from Alibaba's rivals, including JD.com and Pinduoduo, reportedly sparked an antitrust probe.",
                        "However, analysts could quickly reduce those estimates if the SAMR drops the hammer on Tencent as the SAMR did on Alibaba."
                    ],
                    "Sentiment Score": 0.247
                }
            },
            "Weighted Score": 0.097
        },
        "2021-02-09": {
            "Articles": {
                "https://finance.yahoo.com/news/one-woman-turned-40-million-220000269.html": {
                    "Article Title": "How One Woman Turned a $40 Million Kuaishou Bet Into $12 Billion",
                    "Relevant Text": [
                        "At that time, Chinese tech giants like Alibaba Group Holding Ltd. and Tencent Holdings Ltd. were still in Chinese tech giants like Alibaba Group Holding Ltd. and Tencent Holdings Ltd. early years."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://finance.yahoo.com/news/temasek-ceo-ho-ching-retire-022546796.html": {
                    "Article Title": "Temasek’s New Chief Is Upbeat on Long-Term Chinese Investments",
                    "Relevant Text": [
                        "The change in leadership comes at a critical time for Temasek, which owns investments throughout the world from Chinese technology giant Alibaba Group Holding Ltd. to"
                    ],
                    "Sentiment Score": 1.0
                },
                "https://finance.yahoo.com/news/wall-street-investing-billions-scale-100039760.html": {
                    "Article Title": "Wall Street Is Investing Billions to Scale Tiny Mom-and-Pop Sellers on Amazon",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd. Poignant acknowledges that “buying businesses is one thing."
                    ],
                    "Sentiment Score": 1.0
                }
            },
            "Weighted Score": 1.0
        },
        "2021-02-11": {
            "Articles": {
                "https://finance.yahoo.com/news/tencent-executive-held-china-over-022539026.html": {
                    "Article Title": "Tencent Employee Faces Corruption Investigation in China",
                    "Relevant Text": [
                        "Read more: Tencent Fires Over 100 Staffers in a Year-Long Graft ProbeChina is also tightening scrutiny over a Year-Long Graft ProbeChina most powerful tech corporations including Tencent and arch-rival Alibaba Group Holding Ltd., seeking to rein in its most powerful tech corporations including Tencent and arch-rival Alibaba Group Holding Ltd. growing power in a plethora of sectors from finance to e-commerce and the sharing economy.",
                        "CMB International Securities Ltd. “Although the case involves corruption which is a sensitive topic, it seems that the impact will not be as deep as Alibaba at this moment as Alibaba is linked to an individual rather than the internet business."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://www.fool.com/investing/2021/02/11/where-to-invest-5000-right-now/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Where to Invest $5,000 Right Now",
                    "Relevant Text": [
                        "FedEx (NYSE:FDX), or Alibaba Group (NYSE:BABA), you would have made at least $1,000 regardless of which stock you chose.",
                        "AlibabaIf",
                        "you're worried about the pandemic, investing in Chinese-based Alibaba could be another solid option for your portfolio.",
                        "And The Chinese economy is on pace for a record-breaking quarter to start the past year, with one analyst from Absolute Strategy Research expecting growth to be in the neighborhood of 20%.Alibaba offers a wide variety of products and services.",
                        "From 20%.Alibaba Alipay payment platform to cloud computing and online retail, 20%.Alibaba business is in a great position to benefit from a strong national economy.",
                        "On Feb. 2, Alibaba reported $33.9 billion in sales for the period ending Dec. 31, 2020, which was up 37% from the prior-year period.",
                        "And Alibaba annual active consumers over the trailing 12 months totaled 779 million, which was 22 million more than during the period ending Sept. 30, 2020.The stock's P/E multiple of around 30",
                        "And while Alibaba doesn't offer a dividend, Alibaba 23% returns in the past 12 months could have still generated some great profits for your portfolio.",
                        "Alibaba makes for a good investment, whether you are looking for a growth stock to add to your portfolio (that isn't trading at an obscene valuation), or just want to diversify your portfolio and draw on gains made outside of the U.S."
                    ],
                    "Sentiment Score": -0.331
                }
            },
            "Weighted Score": -0.054
        },
        "2021-02-12": {
            "Articles": {
                "https://finance.yahoo.com/news/unusual-options-activity-insight-alibaba-143728471.html": {
                    "Article Title": "Unusual Options Activity Insight: Alibaba Group Holding",
                    "Relevant Text": [
                        "Shares of Alibaba Group Holding (NYSE:BABA) saw some unusual options activity on Friday."
                    ],
                    "Sentiment Score": 1.0
                }
            },
            "Weighted Score": 1.0
        },
        "2021-02-13": {
            "Articles": {
                "https://finance.yahoo.com/news/billionaire-ken-fisher-top-10-182120323.html": {
                    "Article Title": "Billionaire Ken Fisher’s Top 10 Stock Picks",
                    "Relevant Text": [
                        "BABA)Despite concerns over regulatory issues, Alibaba Group Holding Limited (NYSE: BABA) stock price managed to outperform the broader market index.",
                        "Shares of Alibaba are up 21% in the past twelve months, meaning Fisher Asset Management has benefited from Fisher Asset Management stake.",
                        "Polen Capital Management, a value-driven, concentrated, long-term investment management firm, highlighted few stocks including Alibaba in an investor’s letter.",
                        "Here is what Polen Capital Management stated:“One of our largest detractors during the fourth quarter was Alibaba Group Holding Limited.",
                        "Alibaba Group’s stock declined by over 20% during the fourth quarter.",
                        "China delayed the Ant Financial initial public offering (IPO) and launched an anti-trust investigation into alleged anti-competitive practices by Alibaba.",
                        "Many speculate that this was a strong signal from China in response to comments made by Alibaba founder Jack Ma.",
                        "Regardless of the reason, while we acknowledge that operating in China is different than in the U.S., we also recognize Alibaba’s dominance and importance to China long-term goals.",
                        "As China reorients China economy from export-driven to domestic consumption, Alibaba’s platforms—Taobao and Tmall—are arguably the very best tools to achieve this.",
                        "Alibaba enables commerce throughout China from tier-one cities to rural areas.",
                        "Alibaba competitive advantages, tailwinds in digital payments, e-commerce, and cloud technologies are poised for continued growth even with potential government penalties in the future."
                    ],
                    "Sentiment Score": 0.091
                }
            },
            "Weighted Score": 0.091
        },
        "2021-02-15": {
            "Articles": {
                "https://finance.yahoo.com/news/15-richest-people-central-south-200509847.html": {
                    "Article Title": "15 Richest People in Central and South America",
                    "Relevant Text": [
                        "Textil Inditex ADR (OTCMKTS: IDEXY)'s Amancio Ortega, Alibaba Group Holding Ltd – ADR",
                        "(NYSE: BABA)’s Jack Ma, LVMH’s Bernard Arnault, L’Oreal’s Françoise Bettencourt Meyers, SAP SE (NYSE: SAP)’s Hasso Plattner and Kering’s François Pinault."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://finance.yahoo.com/news/alibaba-baba-detractor-miller-value-205219082.html": {
                    "Article Title": "Alibaba (BABA): A Detractor for Miller Value Partners’ Portfolio in Q4’20",
                    "Relevant Text": [
                        "You can view the fund’s top 5 holdings to have a peek at the fund’s top 5 holdings top bets for 2021.Miller Value Partners, in the fund’s top 5 holdings Q4 2020 Investor Letter, said that Alibaba Group Holding Limited (NYSE: BABA) was a top detractor for the fund’s top 5 holdings portfolio in the fourth quarter of 2020.",
                        "Alibaba Group Holding Limited is an e-commerce company that currently has a $730.4 billion market cap.",
                        "For the past 3 months, BABA delivered a 2.69% return and settled at $267.85 per share at the closing of February 12th.",
                        "Here is what Miller Value Partners has to say about Alibaba Group Holding Limited in Miller Value Partners",
                        "Q4 2020 investor letter:\"Alibaba",
                        "BABA had quite the quarter rising up to a high of $317 in October only to end the quarter down 20% after the delay of the Ant IPO and the announced investigations by the Chinese government into monopolistic practices at Miller Value Partners.",
                        "(USD 100.3B).\"Alibaba Group Holding Ltd (NYSE:BABA),",
                        "Logo, big sign, People taking photos, offering, ipo, group, stockChristopher Penler / Shutterstock.comJust recently, we published an article about Polen Capital Management's Alibaba Group Holding Limited (NYSE: BABA) investment thesis.",
                        "BABA delivered a 21.96% return in the past 12 months.",
                        "Story continuesOur calculations show that Alibaba Group Holding Limited (NYSE: BABA) ranks 4th in our list of the 30 most popular stocks among hedge funds."
                    ],
                    "Sentiment Score": 0.6
                }
            },
            "Weighted Score": 0.4
        },
        "2021-02-16": {
            "Articles": {
                "https://finance.yahoo.com/news/softbank-surges-surpass-long-standing-061244282.html": {
                    "Article Title": "Masayoshi Son Just Pushed SoftBank Shares Past Dot-Com Peak",
                    "Relevant Text": [
                        "Masayoshi Son quickly peddled stakes in China e-commerce giant Alibaba Group Holding Ltd., T-Mobile US Inc. and SoftBank Corp., the domestic wireless business.",
                        "The lofty share price may bring back bubble-era memories, when Son briefly became the world’s richest man from backing hundreds of dot-com startups -- only to see the world’s richest man fortune plunge by $70 billion in a matter of months.last week, the world’s richest man revisited the world’s richest man argument that SoftBank is like a goose that lays golden eggs, from Alibaba two decades ago to DoorDash and Coupang now.",
                        "SoftBank calculated SoftBank net asset value at 14,935 yen a share as of Jan. 1, with much of that coming from Alibaba.",
                        "“Currently, Ishino relies heavily on Alibaba.",
                        "The focus will be on whether Ishino is able to lift expectations for Ishino other investments in the two Vision Funds, as Ishino cuts back on Alibaba."
                    ],
                    "Sentiment Score": 0.995
                },
                "https://finance.yahoo.com/news/unusual-options-activity-insight-alibaba-144550371.html": {
                    "Article Title": "Unusual Options Activity Insight: Alibaba Group Holding",
                    "Relevant Text": [
                        "Alibaba Group Holding (NYSE:BABA) shares experienced unusual options activity on Tuesday."
                    ],
                    "Sentiment Score": 0.0
                }
            },
            "Weighted Score": 0.498
        },
        "2021-02-17": {
            "Articles": {
                "https://finance.yahoo.com/news/baidu-back-80-billion-rally-065257825.html": {
                    "Article Title": "Baidu’s Back With an $80 Billion Rally and Electric Car Ambition",
                    "Relevant Text": [
                        "one of China’s big three tech leaders alongside Alibaba Group Holding Ltd. and Tencent Holdings Ltd., Baidu is playing catch up as China internet users increasingly shift from desktop to mobile.",
                        "In January, Alibaba Group Holding Ltd. announced Alibaba Group Holding Ltd.’s teaming up with Zhejiang Geely Holding Group to produce smart electric vehicles."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://finance.yahoo.com/news/jd-com-plans-spin-off-220506628.html": {
                    "Article Title": "JD.com Plans to List Shipping Unit to Ride E-Commerce Boom",
                    "Relevant Text": [
                        "Shopping sites from Alibaba Group Holding Ltd. to Pinduoduo Inc. have benefited as Covid-19 lockdowns drove consumers online and galvanized demand for the services that deliver parcels to doorsteps."
                    ],
                    "Sentiment Score": -1.0
                },
                "https://finance.yahoo.com/news/top-15-serial-entrepreneurs-world-181004627.html": {
                    "Article Title": "Top 15 Serial Entrepreneurs In The World",
                    "Relevant Text": [
                        "Much of ChinaJack Ma wealth is linked to Alibaba (NYSE: BABA) but before The most influential Chinese entrepreneur founded the e-commerce giant, The most influential Chinese entrepreneur co-founded China Pages with The most influential Chinese entrepreneur wife, a business that has developed websites for Chinese companies looking for clients internationally.",
                        "In the following years, Alibaba (NYSE: BABA) became the \"Amazon\" of Asia and ChinaJack Ma was able to expand China's trading platform through Alibaba (NYSE: BABA) subsidiaries that operate in e-commerce, cloud computing, AI, fintech, online payment services, entertainment, and internet services.",
                        "Currently, Alibaba (NYSE: BABA) has a market cap of $714.846 billion.",
                        "Alibaba Group Holding Ltd (NYSE:BABA),",
                        "ChinaJack Ma founder of the Alibaba group,"
                    ],
                    "Sentiment Score": 0.6
                }
            },
            "Weighted Score": 0.267
        },
        "2021-02-18": {
            "Articles": {
                "https://finance.yahoo.com/news/baidu-revenue-beats-estimates-core-214048720.html": {
                    "Article Title": "Baidu’s Stronger-Than-Expected Outlook Validates AI Push",
                    "Relevant Text": [
                        "Once one of China’s big three technology titans alongside Alibaba Group Holding Ltd. and Tencent Holdings Ltd., Baidu is playing catch up as China internet users increasingly shift from desktop to mobile."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://finance.yahoo.com/news/daniel-loebs-top-trades-4th-213342500.html": {
                    "Article Title": "Daniel Loeb's Top Trades of the 4th Quarter",
                    "Relevant Text": [
                        "Fortive Corp. (NYSE:FTV), a reduction in Alibaba Group Holdings Ltd. (NYSE:BABA) and a boost to Upstart Holdings Inc.",
                        "AlibabaLoeb curbed AlibabaLoeb stake in Alibaba (NYSE:BABA) by 44.55%, selling 1.13 million shares.",
                        "AlibabaLoeb now holds 1.4 million shares total, which account for 2.51% of the equity portfolio.",
                        "GuruFocus estimates AlibabaLoeb has gained 10.79% on the investment.",
                        ", GuruFocus rated Alibaba's financial strength 7 out of 10.The company's profitability scored a 9 out of 10 rating.",
                        "Although the operating margin is in decline, Alibaba has strong returns that outperform a majority of competitors as well as a high Piotroski F-Score of 4.",
                        "Of the gurus invested in Alibaba, Fisher has the largest stake with 0.52% of outstanding shares."
                    ],
                    "Sentiment Score": 0.0
                },
                "https://finance.yahoo.com/news/robinhood-rival-webull-raises-funds-064526928.html": {
                    "Article Title": "Robinhood Rival Webull Raises New Funds at $1 Billion Valuation",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd. alum Wang Anquan, has benefited from the surge in trading by individual investors as stock prices soar to all-time highs.",
                        "Wang, who left Alibaba to help run the finance unit at Chinese tech giant Xiaomi Corp. before striking out on his own, founded Webull’s parent company, Fumi Technology, in 2016."
                    ],
                    "Sentiment Score": 0.0
                },
                "https://finance.yahoo.com/news/stanley-druckenmillers-top-6-4th-205552952.html": {
                    "Article Title": "Stanley Druckenmiller's Top 6 4th-Quarter Trades",
                    "Relevant Text": [
                        "- By James LiStanley Druckenmiller (Trades, Portfolio), founder and chairman of the Duquesne Family Office, disclosed this week that his top six trades during the fourth quarter of 2020 included the closure of his holding in Alibaba Group Holding Ltd. (NYSE:BABA)",
                        "4th-Quarter TradesAlibabaDruckenmiller sold 545,755 shares of Alibaba (NYSE:BABA), freeing up 4.66% of the equity portfolio.",
                        "6 4th-Quarter TradesGurus with large holdings in Alibaba include Ken Fisher (Trades, Portfolio) and PRIMECAP Management (Trades,"
                    ],
                    "Sentiment Score": 1.0
                }
            },
            "Weighted Score": 0.143
        },
        "2021-02-19": {
            "Articles": {
                "https://finance.yahoo.com/news/china-twitter-weibo-plans-hong-105633908.html": {
                    "Article Title": "China’s Twitter-Like Weibo Plans Hong Kong Second Listing",
                    "Relevant Text": [
                        "A wave of Hong Kong share sales by U.S.-listed Chinese firms, kicked off by Alibaba Group Holding Ltd.’s second listing in late 2019, continues to grow.",
                        "Story continuesWeibo, which is backed by Alibaba, reported 511 million monthly active users in the third quarter."
                    ],
                    "Sentiment Score": 0.0
                },
                "https://finance.yahoo.com/news/tweedy-brownes-top-4th-quarter-193421895.html": {
                    "Article Title": "Tweedy Browne's Top 4th-Quarter Trades",
                    "Relevant Text": [
                        "Based on the above criteria, 31.The firm's top buys for the quarter were Alibaba Group Holding Ltd. (NYSE:BABA) and Bank of",
                        "(NASDAQ:CSCO).Alibaba Group HoldingThe firm established a new holding of 661,015 shares in Alibaba Group Holding (NYSE:BABA), impacting the equity portfolio by 4.78%.",
                        "During the quarter, shares traded for an average price of $277.43.Tweedy Browne's Top 4th-Quarter TradesAlibaba is a Chinese multinational conglomerate with holdings in e-commerce, retail, internet and technology assets, among many others.",
                        "By volume, Alibaba is the largest e-commerce company in the world, with millions of merchants and hundreds of millions of users.",
                        "On Feb. 19, shares of Alibaba traded around $263.79 for a market cap of $716.89 billion."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://www.investopedia.com/paypal-pypl-goes-after-crypto-curious-customers-5113214?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral": {
                    "Article Title": "PayPal (PYPL) Goes After 'Crypto-Curious' Customers",
                    "Relevant Text": [
                        "PayPal's rollout of crypto offerings is in line with PayPal mission to become a one-stop shop, a closer competitor to a company like Alibaba Group Holding Limited's (BABA) AliPay in China offering a range of services."
                    ],
                    "Sentiment Score": -1.0
                }
            },
            "Weighted Score": 0.267
        },
        "2021-02-20": {
            "Articles": {
                "https://finance.yahoo.com/news/15-best-stocks-buy-now-170127300.html": {
                    "Article Title": "15 Best Stocks To Buy Now For Beginner Investors",
                    "Relevant Text": [
                        "Alibaba Group Holding Limited (NYSE: BABA):",
                        "Ken FisherBABA ranks 7th on our list of the best stocks to buy for beginner investors.",
                        "Polen Capital explained why Polen Capital believe Alibaba will deliver large long-term returns in Alibaba Q4 investor letter:“One of Alibaba largest detractors during the year-ago quarter was Alibaba Group Holding Limited.",
                        "Alibaba Group’s stock declined by over 20% during the quarter ended Dec. 31.",
                        "China delayed the Ant Financial initial public offering (IPO) and launched an anti-trust investigation into alleged anticompetitive practices by Alibaba.",
                        "Many speculate that this was a strong signal from China in response to comments made by Alibaba founder Jack Ma.",
                        "Regardless of the reason, while we acknowledge that operating in China is different than in the U.S., we also recognize Alibaba dominance and importance to China long-term goals.",
                        "As China reorients China economy from export-driven to domestic consumption, Alibaba platforms—Taobao and Tmall—are arguably the very best tools to achieve this.",
                        "Alibaba enables commerce throughout China from tier one cities to rural areas.",
                        "Alibaba competitive advantages, tailwinds in digital payments, e-commerce, and cloud technologies are poised for continued growth even with potential government penalties in the future."
                    ],
                    "Sentiment Score": 0.0
                }
            },
            "Weighted Score": 0.0
        },
        "2021-02-22": {
            "Articles": {
                "https://finance.yahoo.com/news/alibaba-pinduoduo-join-fight-against-210000436.html": {
                    "Article Title": "Alibaba, Pinduoduo Fight Against China’s Looming Food Crisis",
                    "Relevant Text": [
                        "The need to modernize China’s 200 million largely small-scale farms took on added urgency during the pandemic, when output and logistics disruptions coincided with homebound shoppers turning to Alibaba Group Holding Ltd. and other internet retailers for homebound shoppers produce.",
                        "In Fujian along the eastern coast, Alibaba has provided chicken farmers with smart bracelets that track the health of chicken farmers poultry, while under",
                        "The category overtook consumer electronics as the biggest contributor at JD.com in the first half last year, while Alibaba is making a bigger push into the business by taking a larger stake in hypermart Sun Art Retail Group Ltd.",
                        "The owner of Fuxin Farm in Fujian province has equipped 1,000 of The owner of Fuxin Farm in Fujian province chickens with Apple Watch-style bracelets supplied by Alibaba."
                    ],
                    "Sentiment Score": 0.474
                },
                "https://finance.yahoo.com/news/bill-gates-foundation-sells-berkshire-164322178.html": {
                    "Article Title": "Bill Gates' Foundation Sells Berkshire, Exits Alibaba",
                    "Relevant Text": [
                        ", Exits AlibabaGuruFocus gives HathawayThe firm a profitability and growth rating of 7 out of 10.",
                        "Its financial strength is rated 5 out of 10 with a cash-debt ratio of 0.25.The largest guru shareholders of HathawayThe firm are Bill Gates (Trades, Portfolio) with 1.80% of outstanding shares, Diamond Hill Capital (Trades, Portfolio) with 0.11% and Tom Russo (Trades, Portfolio) with 0.09%.AlibabaThe Alibaba Group Holding Ltd.",
                        "(BABA) holding was closed, impacting the portfolio by -0.74%.The",
                        ", Exits AlibabaGuruFocus gives HathawayThe firm a profitability and growth rating of 8 out of 10.",
                        ", Exits AlibabaGuruFocus gives -0.40%.The company a profitability and growth rating of 8 out of 10.",
                        ", Exits AlibabaGuruFocus gives -0.14%.The Internet media giant a profitability and growth rating of 9 out of 10."
                    ],
                    "Sentiment Score": -0.5
                }
            },
            "Weighted Score": -0.092
        },
        "2021-02-23": {
            "Articles": {
                "https://finance.yahoo.com/news/steven-cohens-top-4th-quarter-223012813.html": {
                    "Article Title": "Steven Cohen's Top 4th-Quarter Trades",
                    "Relevant Text": [
                        "Major trades include selling out of his holdings in Alibaba Group Holding Ltd. (NYSE:BABA) and Palantir Technologies Inc.",
                        "12.89%).Steven Cohen's Top 4th-Quarter TradesAlibabaThe",
                        "fourth quarter saw Cohen sell out of Cohen holding in Alibaba (NYSE:BABA).",
                        "Overall, the sale had a -2.12% impact on the portfolio and GuruFocus estimates the total gain of his holding in Alibaba (NYSE:BABA) is the world's largest online and mobile commerce company, measured by GMV.",
                        "Alibaba's China marketplaces accounted for 68% of revenue in fiscal 2019, with Taobao generating revenue through advertising and other merchant data services and Tmall deriving revenue from commission fees."
                    ],
                    "Sentiment Score": 0.6
                },
                "https://www.fool.com/investing/2021/02/23/4-reasons-baidu-should-divest-its-stake-in-iqiyi/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "4 Reasons Baidu Should Divest Its Stake in iQiyi",
                    "Relevant Text": [
                        ") Video and Alibaba's (NYSE:BABA)",
                        "Baidu only controlled 7.1% of China's cloud platform market in the third quarter of 2020, according to Canalys, putting Baidu in a distant fourth place behind Alibaba (NYSE:BABA), Huawei, and Tencent.",
                        "There are plenty of potential buyersBaidu was reportedly in talks to sell potential buyersBaidu stake in iQiyi to Alibaba and Tencent last year, but the government's antitrust probes postponed those efforts.",
                        "However, the government's antitrust probes mainly focus on Alibaba's e-commerce business, Alibaba fintech affiliate Ant Group, and Tencent's WeChat Pay instead of streaming video platforms like iQiyi, Tencent Video, and Youku Tudou.",
                        "If Alibaba and Tencent walk away, Baidu could still potentially sell iQiyi to Xiaomi (OTC:XIACF), which took a stake in the business back in 2014."
                    ],
                    "Sentiment Score": 1.0
                },
                "https://www.fool.com/investing/2021/02/23/farfetch-active-shoppers-forecast-to-grow-10-times/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Farfetch Active Shoppers Are Forecast to Grow 10 Times With Alibaba Assist",
                    "Relevant Text": [
                        "as Online luxury platform Farfetch (NYSE:FTCH) partnership with Alibaba (NYSE:BABA) and Richemont (OTC:CFRUY) brings in incremental new demand from Chinese consumers.",
                        "Last November, Alibaba (NYSE:BABA) and Richemont (OTC:CFRUY)",
                        "An enriching experienceIn a research note to investors, Credit Suisse (NYSE:CS) analyst Stephen Ju also believes the first six months of 2021 will be one of superlatives, but the real opportunity for the platform comes from the platform integration into Alibaba's Luxury Pavilion.",
                        "Launched in 2017 on Tmall, Alibaba's business-to-consumer (B2C) shopping site, Alibaba's Luxury Pavilion is an invitation-only platform offering products that include not only clothes and skincare, but also fashion accessories like watches, and luxury cars.",
                        "Online luxury platform Farfetch (NYSE:FTCH) launched new shopping channels on Tmall, Luxury Soho (a platform for young, but value-minded luxury consumers), and cross-border site Tmall Global, enabling Online luxury platform Farfetch (NYSE:FTCH) to tap into Alibaba's nearly 760 million consumers."
                    ],
                    "Sentiment Score": 0.19
                }
            },
            "Weighted Score": 0.597
        },
        "2021-02-24": {
            "Articles": {
                "https://finance.yahoo.com/news/alibaba-once-hedge-fund-darling-154053254.html": {
                    "Article Title": "Alibaba, Once a Fund Darling, Dumped By Point72, Hillhouse",
                    "Relevant Text": [
                        "Alibaba Group Holding Ltd, once the most valuable company in China, is turning from a global hedge fund favorite to something less than desirable.",
                        "Asset Management and Moore Capital Management to Canadian and U.S. pension funds dumped 101 million of Alibaba’s American depositary receipts in the fourth quarter, cutting the market value of Asset Management and Moore Capital Management to Canadian and U.S. pension funds holdings by $89 billion, according to filing data.",
                        "Alibaba’s shares, which are traded on the New York Stock Exchange, have slumped about 18% since November, when regulators in Beijing halted the $35 billion initial public offering of Alibaba’s affiliate Ant Group at the last minute.",
                        "Government watchdogs have also ordered Ant to overhaul Ant business and began an antitrust investigation of Alibaba.",
                        "Meanwhile, Alibaba, which has invested in a wide range of sectors from online grocery to ride-hailing and artificial intelligence, will face restraints on future expansion.",
                        "In December, China antitrust watchdog fined Alibaba and two other companies over years-old acquisitions.",
                        "Regulators said the e-commerce heavyweight should have sought government approval before increasing the e-commerce heavyweight stake in a department store chain in 2017.If someone were to make an example of how to take down a monopoly in China, Regulators’ve got nothing better than Alibaba, said Jain.",
                        "Jain said Jain had owned Alibaba shares since the company’s initial public offering in 2014, when Jain was the chief investment officer at Vontobel Asset Management.",
                        "Alibaba spokesperson declined to comment on investors selling the stock.",
                        "Investors are questioning whether Alibaba can sustain Alibaba meteoritic rise amid the regulatory scrutiny.",
                        "Alibaba now could face penalties of as much as 10% of Alibaba revenue if Alibaba’s found to have violated antitrust rules.",
                        "Tightening government oversight also threatens to curb Ant’s dominance in online payments and scale back Alibaba expansion into consumer lending and wealth management.",
                        "Alibaba has said that Alibaba’s working with regulators on complying with regulators requirements as the antitrust investigations continue.",
                        "Alibaba sellers are Who’s Who of hedge fund stars.",
                        "Izzy Englander’s Millennium Management LLC was among a minority group of investors who scooped up Alibaba, counting Izzy Englander’s Millennium Management LLC as Alibaba sixth-largest holdings.",
                        "Representatives at a minority group of investors who scooped up Alibaba, counting it as its sixth-largest holdings either declined to comment or didn’t reply to emails or calls.",
                        "The administration had also considered banning U.S. investments in Chinese companies, including Alibaba and Tencent, before deciding against it.",
                        "“Alibaba is a very well-managed company,” said Ahern.",
                        "For GQG’s Jain, the regulatory uncertainties mean the risk-reward calculation is stacking against Alibaba.",
                        "For instance, Alibaba’s becoming much more difficult for Alibaba to grow Alibaba business by acquiring smaller players.",
                        "with Ailbaba’s share price in ninth paragraph.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source."
                    ],
                    "Sentiment Score": 0.524
                },
                "https://finance.yahoo.com/news/tencent-backed-edtech-startup-seeks-053212835.html": {
                    "Article Title": "Tencent-Backed Edtech Startup Seeks Funding at $20 Billion Value",
                    "Relevant Text": [
                        "In January, close rival Zuoyebang raised $1.6 billion from investors including Alibaba Group Holding Ltd. and SoftBank Vision Fund."
                    ],
                    "Sentiment Score": 0.997
                }
            },
            "Weighted Score": 0.286
        },
        "2021-02-25": {
            "Articles": {
                "https://finance.yahoo.com/news/ray-dalio-top-10-stock-110513396.html": {
                    "Article Title": "Ray Dalio’s Top 10 Stock Picks for 2021",
                    "Relevant Text": [
                        "It is also a very nascent market, which attracts other tech giants (including Meituan & Alibaba).",
                        "Alibaba Group Holding Limited (NYSE:",
                        "BABA)The largest Chinese e-commerce platform Alibaba Group Holding Limited (NYSE: BABA) is among Ray Dalio’s top 10 stock picks for 2021.",
                        "Despite pressure on BABA’s shares due to regulatory and political issues, Bridgewater Associates looks confident about the future prospects.",
                        "Bridgewater Associates raised Bridgewater Associates position in BABA by 19% in the fourth quarter to 3.22% of the overall portfolio.",
                        "In a Q4 investor letter, Miller Value Partners, which returned 35.4% for the fourth quarter, highlighted factors behind slower-than-expected performance from Alibaba.",
                        "what Miller Value Partners stated:“Alibaba (BABA) had quite the quarter rising up to a high of $317 in October only to end the fourth quarter down 20% after the delay of the Ant IPO and the announced investigations by the Chinese government into monopolistic practices at Bridgewater Associates.",
                        "During the fourth quarter, what Miller Value Partners stated:“Alibaba (BABA) increased what Miller Value Partners",
                        "stated:“Alibaba (BABA) share buyback program from $6B to $10B.",
                        "what Miller Value Partners stated:“Alibaba (BABA) report second quarter",
                        "what Miller Value Partners stated:“Alibaba",
                        "(BABA) reported revs of Rmb155.1B (USD 23.9B) slightly beating consensus of Rmb 153.9B (USD 23.7B) and adjusted EBITDA of Rmb 47.5B (USD 7.3B) versus 41.3B (USD 6.3B).",
                        "stated:“Alibaba",
                        "(BABA) maintained full year guidance for revenues of Rmb 650B (USD 100.3B).”Click to continue reading and see Ray Dalio Top 5 Stock Picks."
                    ],
                    "Sentiment Score": 0.213
                }
            },
            "Weighted Score": 0.213
        },
        "2021-02-26": {
            "Articles": {
                "https://finance.yahoo.com/news/top-4-4th-quarter-buys-220725104.html": {
                    "Article Title": "Top 4 4th-Quarter Buys of Al Gore's Generation Investment Management",
                    "Relevant Text": [
                        "- By James LiGeneration Investment Management, the firm co-founded by Al Gore (Trades, Portfolio) and David Blood, disclosed this month that the firm top four buys during the fourth quarter of 2020 included a new position in Alibaba Group Holding Ltd. (NYSE:BABA) and boosts to the firm Equifax Inc. (NYSE:EFX), Baxter International Inc.",
                        "Top 4 4th-Quarter Buys of Al Gore Generation Investment ManagementAlibabaGeneration purchased 1,544,863 shares of Alibaba (NYSE:BABA), giving the stake 1.6% weight in the stake equity portfolio.",
                        "Top 4 4th-Quarter Buys of Al Gore Generation Investment ManagementGurus with large positions in Alibaba include Ken Fisher (Trades, Portfolio) and Pioneer Investments (Trades,"
                    ],
                    "Sentiment Score": 0.333
                },
                "https://www.fool.com/investing/2021/02/26/better-buy-mercadolibre-vs-alibaba/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Better Buy: MercadoLibre vs. Alibaba",
                    "Relevant Text": [
                        "MercadoLibre (NASDAQ:MELI) and Alibaba (NYSE:BABA) are two of the world's largest e-commerce companies.",
                        "Alibaba launched the same year and has become China's top e-commerce and cloud services company.",
                        "Alibaba made Alibaba market debut at $68 in 2014, and shares trade at over $240 as of this writing.",
                        "Meanwhile, Alibaba stock advanced less than 20% during the same period as ongoing regulatory concerns kept many investors away.",
                        "The differences between MercadoLibre and AlibabaMercadoLibre splits MercadoLibre operation into two main segments: Alibaba commerce business, which earns commissions and shipping fees from sellers, and Alibaba fintech business, which includes Alibaba payment service Mercado Pago and Alibaba credit system Mercado Credito.",
                        "Alibaba generated 64% of Alibaba revenue from Alibaba commerce business in the first nine months of 2020 with the rest coming from Alibaba fintech services.",
                        "Alibaba splits Alibaba business into four main segments: the core commerce unit, which covers Alibaba online and brick-and-mortar stores; Alibaba Cloud, Alibaba cloud infrastructure platform; the digital media and entertainment unit, which includes Alibaba streaming media and online gaming businesses; and the innovation initiatives segment, which houses Alibaba other non-core businesses.",
                        "Though there are four reporting segments, Alibaba generated 87% of Alibaba revenue and the entirety of Alibaba profits from Alibaba core commerce business in the first nine months of fiscal 2021 (which ends March 31).",
                        "Alibaba is consistently profitable, but Alibaba continually subsidizes the growth of Alibaba unprofitable ventures with Alibaba core commerce segment.",
                        "Turning to Mercado Pago's TPV (total payment volume) counterpart in the Chinese market, Alibaba grew revenue 34% year over year to 529.9 billion yuan ($81.2 billion) in the first nine months of fiscal 2021.",
                        "Core commerce revenue rose 34%, but Core commerce revenue margins are contracting as Alibaba relies more on lower-margin businesses (including Core commerce revenue brick-and-mortar stores, cross-border marketplace, direct sales, and logistics unit) to drive Core commerce revenue top-line growth.",
                        "But looking ahead, Alibaba could face mounting pressure to narrow the losses at Alibaba three unprofitable businesses as Alibaba core commerce profitability declines.",
                        "Alibaba also faces an ongoing antitrust probe in China, which could force Alibaba to eliminate Alibaba exclusive deals with merchants and aggressive pricing strategies for new users.",
                        "Those headwinds, along with intense domestic competition and tighter auditing requirements for Chinese stocks in the U.S., likely held Alibaba stock back as other e-commerce stocks soared over the past year.",
                        "Profits will continue rising too, but Alibaba stock still looks pricey at 570 times forward earnings and 15 times 2021 sales, even though it may be cheaper relative to other high-growth tech stocks.",
                        "Alibaba is not far behind with consensus estimates for 51% and 31% revenue growth in fiscal 2021 and 2022, respectively.",
                        "Those are impressive numbers for a stock that trades at just 20 times forward earnings and less than five times sales, but Alibaba regulatory hurdles could still cause Alibaba to miss those rosy expectations and result in other challenges for the company long term.",
                        "MercadoLibre also won't suffer as much as Alibaba if trade tensions escalate between the U.S. and China again.",
                        "That's why I personally own MercadoLibre rather than Alibaba, and investors are better off buying the former over the latter right now."
                    ],
                    "Sentiment Score": 0.105
                }
            },
            "Weighted Score": 0.079
        },
        "2021-02-27": {
            "Articles": {
                "https://www.fool.com/investing/2021/02/27/2-hyper-growth-stocks-buy-in-the-next-bear-market/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "2 Hyper-Growth Stocks to Buy in the Next Bear Market",
                    "Relevant Text": [
                        "Pinduoduo has posted impressive gainsI'm an avid fan of e-commerce platform operators like Alibaba (NYSE:BABA),",
                        "In the next few quarters, I think Pinduoduo will report more active buyers than Alibaba.",
                        "Alibaba revenue grew 44% during the quarter when China first imposed statewide lockdowns, demonstrating that Alibaba can handle external shocks.",
                        "Pinduoduo boasts a fast-growing platform almost as large as Taobao and Tmall, the marketplaces that Alibaba owns.",
                        "Yet Pinduoduo's annual revenue is just a fraction of Alibaba's $14 billion in China-based e-commerce revenue for the same period.",
                        "Pinduoduo could even launch ancillary ventures in areas such as logistics and payments -- which is what Alibaba has done with Alipay and Cainiao, among other businesses.",
                        "For perspective, Alibaba trades at a fourth of that multiple."
                    ],
                    "Sentiment Score": 0.143
                },
                "https://www.fool.com/investing/2021/02/27/better-buy-amazon-vs-alibaba/?source=eptyholnk0000202&utm_source=yahoo-host&utm_medium=feed&utm_campaign=article": {
                    "Article Title": "Better Buy: Amazon vs. Alibaba",
                    "Relevant Text": [
                        "Amazon (NASDAQ:AMZN) and Alibaba (NYSE:BABA) are the world's two biggest e-commerce companies and, in many ways, the world's two biggest e-commerce companies are mirror images of one another.",
                        "Alibaba:",
                        "The best of growth and valueAlibaba shares were rocked in recent months by rumors that founder Jack Ma was \"missing\" and after Chinese officials announced an antitrust investigation into Amazon.",
                        "Those events underscore some of the risks facing Chinese stocks like Alibaba, but the stock's recovery once founder Jack Ma made a public appearance is a reminder that those risks are often exaggerated.",
                        "Like Amazon, Alibaba has put up strong growth during the pandemic even as China rebounded much faster than the U.S. from the crisis.",
                        "Alibaba's revenue jumped 37% in Alibaba most recent quarter to $33.9 billion and Alibaba finished the year with 779 million active annual consumers, showing the value of operating in a massive market like China.",
                        "Because Alibaba core business is an e-commerce marketplace, Alibaba is also highly profitable, collecting commissions on sales on Alibaba marketplaces like TMall and Taobao.",
                        "Over the last year, Alibaba passed $1 trillion in gross merchandise volume (GMV), making Alibaba the biggest online marketplace by GMV in the world.",
                        "In its most recent quarter, adjusted EBITDA increased 22% to $10.5 billion, giving Alibaba a 31% adjusted EBITDA margin.",
                        "Alibaba's other businesses like cloud and logistics saw revenue growth of 50% or better in its most recent quarter, and Alibaba is also continually expanding through partnerships with businesses like Farfetch and Dufry, leveraging other companies' assets and increasing Alibaba competitive advantages.",
                        "Alibaba is an attractive partner for almost any brand looking to do business in China.",
                        "Alibaba's base in China also sets Alibaba's base in China up for strong growth.",
                        "Amazon and Alibaba: Head-to-headBoth Amazon and Alibaba have similar businesses and enjoy competitive advantage through network effects and Amazon and Alibaba:",
                        "Head-to-headBoth Amazon and Alibaba leading positions in e-commerce in Amazon and Alibaba: Head-to-headBoth Amazon and Alibaba respective geographies.",
                        "Amazon trades at a price-to-earnings valuation of 75, while Alibaba is valued at just 26, making Amazon nearly three times as cheap as Amazon.",
                        "Considering the significant valuation gap between the two stocks, Alibaba is the better buy today.",
                        "While both of these stocks look poised to outperform the S&P 500 over the coming years based on both of these stocks competitive advantages and growth momentum, Alibaba is the better value of the two.",
                        "Alibaba lower price tag gives investors assurance that even if growth stocks fall -- a distinct possibility in the economic reopening -- Alibaba shares will remain solid."
                    ],
                    "Sentiment Score": -0.166
                }
            },
            "Weighted Score": -0.055
        }
    }
}